----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Code/LogFiles/Analyze_Merged_Covenants.log
  log type:  text
 opened on:  14 Nov 2024, 21:10:01

. 
. /**************
>         Data Cleaning
>         ***************/
. 
. import delimited "$cleandir/agreements_mm_dealinfo.csv", clear
(encoding automatically selected: ISO-8859-1)
(56 vars, 10,727 obs)

. keep if year >= 2010
(3,822 observations deleted)

. destring atq-prev_ebitda sic deal_amount1 interest_spread1 lender_is_private_credit, replace ignore("NA")
atq: characters N A removed; replaced as double
(51 missing values generated)
revtq already numeric; no replace
niq: characters N A removed; replaced as double
(1 missing value generated)
ibq: characters N A removed; replaced as double
(1 missing value generated)
ltq: characters N A removed; replaced as double
(51 missing values generated)
xrdq: characters N A removed; replaced as double
(51 missing values generated)
xrdy: characters N A removed; replaced as double
(4082 missing values generated)
ppegtq: characters N A removed; replaced as double
(359 missing values generated)
ppentq: characters N A removed; replaced as double
(723 missing values generated)
mkvaltq: characters N A removed; replaced as double
(416 missing values generated)
prccq: characters N A removed; replaced as double
(406 missing values generated)
cshoq: characters N A removed; replaced as double
(98 missing values generated)
be: characters N A removed; replaced as double
(51 missing values generated)
roa: characters N A removed; replaced as double
(51 missing values generated)
leverage: characters N A removed; replaced as double
(51 missing values generated)
market_to_book: characters N A removed; replaced as double
(417 missing values generated)
prev_at: characters N A removed; replaced as double
(124 missing values generated)
prev_ebitda: characters N A removed; replaced as double
(124 missing values generated)
sic: characters N A removed; replaced as int
(124 missing values generated)
deal_amount1: characters N A removed; replaced as double
(713 missing values generated)
interest_spread1: characters N A removed; replaced as double
(3260 missing values generated)
lender_is_private_credit: characters N A removed; replaced as byte
(913 missing values generated)

. drop if atq >= .
(51 observations deleted)

. * generate maturity
. replace maturity1 = "" if maturity1 == "NA"
(1,593 real changes made)

. gen maturity_date = date(maturity1, "YMD")
(1,593 missing values generated)

. gen start_date = date(date, "YMD")

. gen maturity_year = (maturity_date - start_date)/365
(1,593 missing values generated)

. drop if maturity_year < 0
(63 observations deleted)

. 
. * use libor3 to convert floating rates to fixed rates
. replace interest_spread1 = interest_spread1 + rate if interest_type == "floating"
(3,121 real changes made)

. gen floating = 1 if interest_type == "floating"
(2,221 missing values generated)

. replace floating = 0 if floating == .
(2,221 real changes made)

. 
. * generate margin 
. gen margin_bps = interest_spread1*100
(3,218 missing values generated)

. 
. * winsorize at 1%-99%s
. winsor2 atq-leverage prev_ebitda deal_amount1 interest_spread1 maturity_year margin_bps , cuts(1 99) replace

. sum lender_is_nonbank lender_is_private_credit_entity monthly_fs-lender_meeting atq-leverage prev_ebitda deal_amount1 maturity_year margin_bps

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
lender_is_~k |      6,791    .1903991    .3926448          0          1
lender_is_~y |      6,791    .0478575    .2134803          0          1
  monthly_fs |      6,791    .2213223    .4151676          0          1
projected_fs |      6,791    .4891769    .4999197          0          1
lender_mee~g |      6,791    .1291415    .3353812          0          1
-------------+---------------------------------------------------------
         atq |      6,791    2708.095    3778.817     49.233   22847.97
       revtq |      6,791    264.3501    250.1614     11.538    960.782
         niq |      6,791    11.27904    66.49413   -267.709    310.342
         ibq |      6,791    11.03463    64.83717   -260.449    305.704
         ltq |      6,791    1784.168    2714.457     21.098   16682.53
-------------+---------------------------------------------------------
        xrdq |      6,791    .0040993    .0116268          0    .074387
        xrdy |      2,788    29.25424    67.79925          0    454.085
      ppegtq |      6,486    .4928168    .4862232          0   2.465878
      ppentq |      6,128    742.4012    1494.105          0       8723
     mkvaltq |      6,429    2224.262    3528.136     8.1584   21641.07
-------------+---------------------------------------------------------
       prccq |      6,432    31.31493    38.57164        .21      250.5
       cshoq |      6,743    77.62511    84.40513       1.76    492.461
          be |      6,791    907.4794    1331.637   -894.305   7505.223
         roa |      6,791    .0004072    .0413785  -.2033918   .1513436
    leverage |      6,791     .641779       .2639   .1318674   1.633763
-------------+---------------------------------------------------------
 prev_ebitda |      6,667    189.7026    270.8751   -266.806   1388.789
deal_amount1 |      6,088    362.2311    448.0251      3.441       2500
maturity_y~r |      5,198    4.485122    2.083516   .3424658   14.79726
  margin_bps |      3,573    509.6418    286.1197        103       1500

. 
. * generate FF-12 Industry
. sicff sic, ind(12)

. 
. label define ff_12_lab 1 "Consumer NonDurables" 2 "Consumer Durables" 3 "Manufacturing" 4 "Oil, Gas, and Coal Extraction and Products" 5 "Chemicals and Allied Produ
> cts" 6 "Business Equipment" 7 "Telephone and Television Transmission" 8 "Utilities" 9 "Wholesale, Retail, and Some Services" 10 "Healthcare, Medical Equipment, and 
> Drugs" 11 "Finance" 12 "Other"

. label values ff_12 ff_12_lab

. 
. egen hard_info = rowmax(monthly_fs projected_fs)

. gen info_n = monthly_fs + projected_fs + lender_meeting

. egen all_info = rowmin(monthly_fs projected_fs lender_meeting)

. 
. gen lender_is_other_nonbank = 1 if lender_is_nonbank == 1 & lender_is_private_credit != 1
(5,902 missing values generated)

. replace lender_is_other_nonbank = 0 if lender_is_nonbank == 0
(5,498 real changes made)

. 
. drop if deal_amount1 == .
(703 observations deleted)

. 
. save "$intdir/intermediate_data_after_main_regression.dta", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/intermediate_data_after_main_regression.dta saved

. 
. *** manually fill in missing maturity + interest spread for private credit deals
. preserve

.         keep if lender_is_private_credit == 1
(5,727 observations deleted)

.         keep if maturity_date == . | interest_spread1 == .
(259 observations deleted)

.         keep accession type_filing type_attachment deal_amount* interest_spread* maturity*

.         export delimited "$intdir/manual_check_dl_deals.csv", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/manual_check_dl_deals.csv saved

. restore

. 
. * merge the private credit manual added observations back 
. import delimited "$intdir/manual_checked_dl_deals.csv", clear
(encoding automatically selected: UTF-8)
(11 vars, 102 obs)

. drop v10 v11

. 
. merge 1:1 accession type_filing type_attachment using "$intdir/intermediate_data_after_main_regression.dta", nogen
(variable type_filing was str6, now str8 to accommodate using data's values)
(variable type_attachment was str11, now str20 to accommodate using data's values)
(variable interest_spread was str70, now strL to accommodate using data's values)
(variable deal_amount1 was float, now double to accommodate using data's values)
(variable interest_spread1 was float, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,986
        from master                         0  
        from using                      5,986  

    Matched                               102  
    -----------------------------------------

. 
. drop if maturity_year == .
(1,002 observations deleted)

. drop if interest_spread1 == .
(1,905 observations deleted)

. 
. *** drop obs with missing ebitda, tangibility
. drop if prev_ebitda == . | ppegtq == .
(174 observations deleted)

. 
. save "$intdir/intermediate_data_after_main_regression.dta", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/intermediate_data_after_main_regression.dta saved

. 
. *** New Nov 6th 
. keep accession-type_attachment

. export delimited "$intdir/final_regression_sample_filings.csv", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/final_regression_sample_filings.csv saved

. *sample 1
. *export delimited "$intdir/final_regression_sample_filings_sample.csv", replace
. 
. use "$intdir/intermediate_data_after_main_regression.dta", clear

. 
. *** merge newly cleaned datasets to final data
. import delimited "$datadir/LoansFull/loancontracts_with_other_dealinfo.csv", varnames(1) clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 3,007 obs)

. merge 1:1 accession type_filing type_attachment using "$intdir/intermediate_data_after_main_regression.dta", nogen
(variable type_attachment was str12, now str20 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,007  
    -----------------------------------------

. 
. gen secured1 = 1 if secured != "Not Found"
(955 missing values generated)

. replace secured1 = 0 if secured1 == .
(955 real changes made)

. 
. gen second_lien1 = 1 if second_lien == "Yes" | second_lien == "Second Lien"
(2,877 missing values generated)

. replace second_lien1 = 0 if second_lien1 == . 
(2,877 real changes made)

. 
. gen senior1 = 1 if senior != "Not Found"
(996 missing values generated)

. replace senior1 = 0 if senior1 == .
(996 real changes made)

. 
. gen asset_based1 = 1 if asset_based != "Not Found"
(2,541 missing values generated)

. replace asset_based1 = 0 if asset_based1 == .
(2,541 real changes made)

. 
. drop secured second_lien senior asset_based

. 
. save "$intdir/intermediate_data_after_main_regression.dta", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/intermediate_data_after_main_regression.dta saved

. 
. *** merge with abl and second lien classification using textual extraction instead (more conservative)
. import delimited "$intdir/abl_secondlien.csv", varnames(1) clear
(encoding automatically selected: UTF-8)
(5 vars, 3,007 obs)

. merge 1:1 accession type_filing type_attachment using "$intdir/intermediate_data_after_main_regression.dta", nogen
(variable type_attachment was str12, now str20 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,007  
    -----------------------------------------

. 
. save "$intdir/intermediate_data_after_main_regression.dta", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Intermediate/intermediate_data_after_main_regression.dta saved

. 
. /**************
>         Summary Table
>         ***************/
. 
. *** Table 1: Descriptives *** 
. 
. la var lender_is_other_nonbank "Other Nonbank Lender"

. la var lender_is_nonbank "Nonbank Lender"

. la var lender_is_private_credit "Private Credit Lender"

. la var monthly_fs "Monthly Financial Statement"

. la var projected_fs "Annual Budget/Projection"

. la var lender_meeting "Lender Meeting"

. la var atq "Total Assets (Million USD)"

. la var revtq "Revenue (Million USD)"

. la var niq "Net Income (Million USD)"

. la var ibq "Income Before Extraordinary Items (Million USD)"

. la var ltq "Long-Term Debt (Million USD)"

. la var xrdq "R\&D Intensity"

. la var ppegtq "Tangibility"

. la var roa "ROA"

. la var leverage "Leverage Ratio"

. la var prev_ebitda "EBITDA (Million USD)"

. la var maturity_year "Maturity (Years)"

. la var margin_bps "Floating Interest Margin (Basis Points)"

. la var deal_amount1 "Deal Amount (Million USD)"

. la var interest_spread1 "Interest Margin (Percentage)"

. la var floating "Floating Rate"

. la var asset_based "Asset Based Loan"

. la var second_lien "Second Lien"

. 
. * Panel A (Number of Deals By Industry)
. dtable i.ff_12, by(lender_is_nonbank) export("$tabdir/tabulation_ff12_all.tex", tableonly replace) note("Panel A: Number of Deals By Industry")

-------------------------------------------------------------------------------------
                                                          Nonbank Lender             
                                                   0            1           Total    
-------------------------------------------------------------------------------------
N                                            2,339 (77.8%) 668 (22.2%) 3,007 (100.0%)
ff_12                                                                                
  Consumer NonDurables                          124 (5.3%)   33 (4.9%)     157 (5.2%)
  Consumer Durables                              63 (2.7%)   12 (1.8%)      75 (2.5%)
  Manufacturing                                310 (13.3%)   43 (6.4%)    353 (11.7%)
  Oil, Gas, and Coal Extraction and Products    158 (6.8%)   58 (8.7%)     216 (7.2%)
  Chemicals and Allied Products                  76 (3.2%)   17 (2.5%)      93 (3.1%)
  Business Equipment                           295 (12.6%)   61 (9.1%)    356 (11.8%)
  Telephone and Television Transmission          59 (2.5%)   20 (3.0%)      79 (2.6%)
  Utilities                                      63 (2.7%)   12 (1.8%)      75 (2.5%)
  Wholesale, Retail, and Some Services          194 (8.3%)  70 (10.5%)     264 (8.8%)
  Healthcare, Medical Equipment, and Drugs      145 (6.2%)  92 (13.8%)     237 (7.9%)
  Finance                                      430 (18.4%) 110 (16.5%)    540 (18.0%)
  Other                                        422 (18.0%) 140 (21.0%)    562 (18.7%)
-------------------------------------------------------------------------------------
Panel A: Number of Deals By Industry
(collection DTable exported to file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/tabulation_ff12_all.tex)

. dtable i.ff_12, by(lender_is_private_credit) export("$tabdir/tabulation_ff12_pc.tex", tableonly replace) note("Panel A: Number of Deals By Industry")

-------------------------------------------------------------------------------------
                                                       Private Credit Lender         
                                                   0            1           Total    
-------------------------------------------------------------------------------------
N                                            2,339 (89.2%) 284 (10.8%) 2,623 (100.0%)
ff_12                                                                                
  Consumer NonDurables                          124 (5.3%)   22 (7.7%)     146 (5.6%)
  Consumer Durables                              63 (2.7%)    7 (2.5%)      70 (2.7%)
  Manufacturing                                310 (13.3%)   20 (7.0%)    330 (12.6%)
  Oil, Gas, and Coal Extraction and Products    158 (6.8%)   25 (8.8%)     183 (7.0%)
  Chemicals and Allied Products                  76 (3.2%)    4 (1.4%)      80 (3.0%)
  Business Equipment                           295 (12.6%)  34 (12.0%)    329 (12.5%)
  Telephone and Television Transmission          59 (2.5%)    5 (1.8%)      64 (2.4%)
  Utilities                                      63 (2.7%)    5 (1.8%)      68 (2.6%)
  Wholesale, Retail, and Some Services          194 (8.3%)   28 (9.9%)     222 (8.5%)
  Healthcare, Medical Equipment, and Drugs      145 (6.2%)  51 (18.0%)     196 (7.5%)
  Finance                                      430 (18.4%)  31 (10.9%)    461 (17.6%)
  Other                                        422 (18.0%)  52 (18.3%)    474 (18.1%)
-------------------------------------------------------------------------------------
Panel A: Number of Deals By Industry
(collection DTable exported to file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/tabulation_ff12_pc.tex)

. dtable i.ff_12, by(lender_is_other_nonbank) export("$tabdir/tabulation_ff12_other.tex", tableonly replace) note("Panel A: Number of Deals By Industry")

-------------------------------------------------------------------------------------
                                                       Other Nonbank Lender          
                                                   0            1           Total    
-------------------------------------------------------------------------------------
N                                            2,339 (85.9%) 384 (14.1%) 2,723 (100.0%)
ff_12                                                                                
  Consumer NonDurables                          124 (5.3%)   11 (2.9%)     135 (5.0%)
  Consumer Durables                              63 (2.7%)    5 (1.3%)      68 (2.5%)
  Manufacturing                                310 (13.3%)   23 (6.0%)    333 (12.2%)
  Oil, Gas, and Coal Extraction and Products    158 (6.8%)   33 (8.6%)     191 (7.0%)
  Chemicals and Allied Products                  76 (3.2%)   13 (3.4%)      89 (3.3%)
  Business Equipment                           295 (12.6%)   27 (7.0%)    322 (11.8%)
  Telephone and Television Transmission          59 (2.5%)   15 (3.9%)      74 (2.7%)
  Utilities                                      63 (2.7%)    7 (1.8%)      70 (2.6%)
  Wholesale, Retail, and Some Services          194 (8.3%)  42 (10.9%)     236 (8.7%)
  Healthcare, Medical Equipment, and Drugs      145 (6.2%)  41 (10.7%)     186 (6.8%)
  Finance                                      430 (18.4%)  79 (20.6%)    509 (18.7%)
  Other                                        422 (18.0%)  88 (22.9%)    510 (18.7%)
-------------------------------------------------------------------------------------
Panel A: Number of Deals By Industry
(collection DTable exported to file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/tabulation_ff12_other.tex)

. 
. local all_borr_cov "atq revtq niq roa leverage prev_ebitda xrdq ppegtq"

. local all_deal_vars "deal_amount1 maturity_year interest_spread1 floating asset_based second_lien"       

. 
. * Panel B (Summary Statistics by Banks and Nonbanks Respectively)
. estpost sum monthly_fs-lender_meeting `all_borr_cov' `all_deal_vars' if lender_is_nonbank == 0, de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10) 
-------------+-----------------------------------------------------------------------------------------------------------------------------------------------
  monthly_fs |      2339       2339   .2428388   .1839468   .4288902    1.19945   2.438681        568          0          1          0          0          0 
projected_fs |      2339       2339   .5874305   .2424596   .4924018  -.3551945   1.126163       1374          0          1          0          0          0 
lender_mee~g |      2339       2339   .1710133   .1418284   .3766011    1.74751   4.053792        400          0          1          0          0          0 
         atq |      2339       2339   2513.948   1.24e+07   3518.483   3.294639   16.15165    5880123     49.233   22847.97     49.233    139.873    239.403 
       revtq |      2339       2339   276.5135   63564.42   252.1198   1.083918    3.15445   646765.1     11.538    960.782     11.661     22.251     35.498 
         niq |      2339       2339   11.46243   4329.335   65.79768    .467835   12.09654   26810.62   -267.709    310.342   -260.449        -63    -29.944 
         roa |      2339       2339   .0039419   .0012867   .0358702  -.9119246    14.2551    9.21999  -.2033918   .1513436  -.1258989  -.0446498  -.0247174 
    leverage |      2339       2339   .6289596   .0613732   .2477361   .9229141   5.221363   1471.137   .1318674   1.633763   .1454839   .2588207    .337665 
 prev_ebitda |      2339       2339   182.6943   66575.56   258.0224   2.148474   8.739671     427322   -266.806   1388.789   -255.927    -23.089       .933 
        xrdq |      2339       2339   .0036568   .0001007   .0100349   4.186066    24.0809   8.553285          0    .074387          0          0          0 
      ppegtq |      2339       2339   .4577687    .203495   .4511042   1.380433   5.388306   1070.721          0   2.465878          0          0   .0063855 
deal_amount1 |      2339       2339   376.8098   213799.8   462.3849   2.446758    9.73998   881358.2      3.441       2500          5       16.5         30 
maturity_y~r |      2339       2339   4.551718   4.419347   2.102224   1.123295   7.820615   10646.47   .3424658   14.79726   .3808219   .9917808   1.923288 
interest_s~1 |      2339       2339   4.433855   5.268908    2.29541   1.425345    5.94954   10370.79       1.03         15   1.087537       1.84   2.158404 
    floating |      2339       2339   .9482685   .0490763   .2215318  -4.047855   17.38513       2218          0          1          0          0          1 
 asset_based |      2339       2339   .0162463   .0159892   .1264482   7.653048   59.56915         38          0          1          0          0          0 
 second_lien |      2339       2339   .0149637   .0147461   .1214333   7.990229   64.84376         35          0          1          0          0          0 

             |    e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+------------------------------------------------------------------
  monthly_fs |         0          0          0          1          1          1 
projected_fs |         0          1          1          1          1          1 
lender_mee~g |         0          0          0          1          1          1 
         atq |   548.438   1413.255   2894.175   5874.109       8805   21718.25 
       revtq |    75.976    182.405    416.825        693    819.858    960.782 
         niq |    -4.357      5.375     24.809      61.75    108.022    310.342 
         roa | -.0052398   .0049655   .0151162   .0303462   .0495232   .1513436 
    leverage |   .474969   .6108942    .761748   .9184812   1.039211   1.533542 
 prev_ebitda |    29.785     97.277    243.684      524.1     723.64     1293.1 
        xrdq |         0          0          0   .0122186    .023003   .0560003 
      ppegtq |  .0983739   .3134642   .7468097   1.067078   1.263438   1.995003 
deal_amount1 |       100        230        450       1000       1325       2500 
maturity_y~r |         3   4.986301    5.00274   6.989041   7.005479   13.00274 
interest_s~1 |      2.75     3.8007   5.847323   7.425601        8.6       12.5 
    floating |         1          1          1          1          1          1 
 asset_based |         0          0          0          0          0          1 
 second_lien |         0          0          0          0          0          1 

. esttab using "$tabdir/summary_table_by_bank.tex", replace ///
>     cells("count(fmt(%9.0fc)) mean(fmt(%9.2f)) sd(fmt(%9.2f)) min(fmt(%9.2f)) p50(fmt(%9.2f)) max(fmt(%9.2f))") noobs nonum collabels(Count Mean "Std. Dev." Min Med
> ian Max) title(": Summary Statistics for Banks") label
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/summary_table_by_bank.tex)

.         
. estpost sum monthly_fs-lender_meeting `all_borr_cov' `all_deal_vars' if lender_is_nonbank == 1, de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10) 
-------------+-----------------------------------------------------------------------------------------------------------------------------------------------
  monthly_fs |       668        668   .4311377   .2456257   .4956064   .2780992   1.077339        288          0          1          0          0          0 
projected_fs |       668        668   .5883234   .2425621   .4925059   -.358938   1.128836        393          0          1          0          0          0 
lender_mee~g |       668        668   .2814371   .2025335   .4500372   .9720381   1.944858        188          0          1          0          0          0 
         atq |       668        668   1447.411    6429114    2535.57   4.903554   34.09568   966870.5     49.233   22847.97     49.233     77.603    108.859 
       revtq |       668        668   167.8398   40423.24   201.0553   1.944413   6.488643     112117     11.538    960.782     11.538     13.735     17.261 
         niq |       668        668  -10.06763   3877.818   62.27213  -.4550331   12.89518  -6725.174   -267.709    310.342   -267.709   -112.663    -49.921 
         roa |       668        668  -.0213145   .0033537   .0579108  -.8492956   5.703374  -14.23806  -.2033918   .1513436  -.2033918  -.1463058  -.0930039 
    leverage |       668        668   .7503762   .0992078   .3149727   .8086381   3.680482   501.2513   .1318674   1.633763   .1781166    .309864   .3937478 
 prev_ebitda |       668        668   74.75092   38294.67   195.6902   3.240218   18.53508   49933.61   -266.806   1388.789   -266.806   -101.409    -41.548 
        xrdq |       668        668   .0064278   .0002754   .0165951   3.050843   11.68689   4.293773          0    .074387          0          0          0 
      ppegtq |       668        668   .5075072   .2969065   .5448913   1.705185    6.24219   339.0148          0   2.465878          0          0    .005899 
deal_amount1 |       668        668   172.1707    62867.2   250.7333   3.604996   21.91835     115010       .005       2500        .02      3.441         10 
maturity_y~r |       668        668   4.762054   6.884113   2.623759   1.585072   7.012038   3181.052   .3424658   14.79726   .3424658   1.063014   1.991781 
interest_s~1 |       668        668   7.119251   11.37546   3.372753   .3344703   2.303538   4755.659          1         15        1.5      2.255   2.837222 
    floating |       668        668   .7290419    .197836   .4447875  -1.030665   2.062271        487          0          1          0          0          0 
 asset_based |       668        668   .0134731   .0133115   .1153753   8.440135   72.23588          9          0          1          0          0          0 
 second_lien |       668        668   .0299401   .0290873   .1705499   5.516418   31.43086         20          0          1          0          0          0 

             |    e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+------------------------------------------------------------------
  monthly_fs |         0          0          1          1          1          1 
projected_fs |         0          1          1          1          1          1 
lender_mee~g |         0          0          1          1          1          1 
         atq |  262.9405   654.1445   1630.659     3405.5       5122      14046 
       revtq |   32.8665     84.238   205.4845    459.019    621.345      917.3 
         niq |  -19.6525     -3.479     6.1725     23.245     57.065        204 
         roa |  -.039834   -.006262   .0077274   .0229311   .0342861   .1513436 
    leverage |  .5365917   .7104416   .8972318   1.152865   1.382623   1.633763 
 prev_ebitda |   -3.8695     25.111     97.011    232.786     406.55        958 
        xrdq |         0          0   .0001841   .0224251   .0489172    .074387 
      ppegtq |  .0936678    .329389   .8020536   1.122001   1.500499   2.465878 
deal_amount1 |        30         90     207.25   425.9487    628.375       1300 
maturity_y~r |   2.99726   4.878082   5.249315   7.090411         10   14.79726 
interest_s~1 |  4.357927   6.917862    9.58275         12      13.01         15 
    floating |         0          1          1          1          1          1 
 asset_based |         0          0          0          0          0          1 
 second_lien |         0          0          0          0          0          1 

. esttab using "$tabdir/summary_table_by_nonbank.tex", replace ///
>     cells("count(fmt(%9.0fc)) mean(fmt(%9.2f)) sd(fmt(%9.2f)) min(fmt(%9.2f)) p50(fmt(%9.2f)) max(fmt(%9.2f))") noobs nonum collabels(Count Mean "Std. Dev." Min Med
> ian Max) title(": Summary Statistics for All Nonbank Lenders") label
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/summary_table_by_nonbank.tex)

.         
. estpost sum monthly_fs-lender_meeting `all_borr_cov' `all_deal_vars' if lender_is_other_nonbank == 1, de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10) 
-------------+-----------------------------------------------------------------------------------------------------------------------------------------------
  monthly_fs |       384        384   .3567708   .2300846   .4796713   .5979762   1.357576        137          0          1          0          0          0 
projected_fs |       384        384   .5338542   .2495036   .4995034  -.1357281   1.018422        205          0          1          0          0          0 
lender_mee~g |       384        384    .234375   .1799119   .4241602   1.254109   2.572789         90          0          1          0          0          0 
         atq |       384        384   1598.149    6118516   2473.563    4.41336   29.36856   613689.1     49.233   22847.97     49.233     91.528    146.048 
       revtq |       384        384   173.2771    43461.7   208.4747   1.936731   6.399044   66538.39     11.538    960.782     11.538     14.662      17.49 
         niq |       384        384  -5.296997   4401.436   66.34332   -.005943   12.86234  -2034.047   -267.709    310.342   -267.709   -121.834    -45.965 
         roa |       384        384  -.0135521   .0028752   .0536206  -.6718637   6.870054  -5.203993  -.2033918   .1513436  -.2033918  -.1092319  -.0777487 
    leverage |       384        384   .7347029   .1044141   .3231318   .9096214   3.764616   282.1259   .1318674   1.633763   .1765151   .2935738   .3967898 
 prev_ebitda |       384        384   92.42802   38418.92   196.0075   2.922863   16.18064   35492.36   -266.806   1388.789   -266.806    -91.957    -30.179 
        xrdq |       384        384   .0043023   .0001971   .0140378   3.964804   18.53689   1.652081          0    .074387          0          0          0 
      ppegtq |       384        384   .5059921   .3219796   .5674324   1.743985   6.315671    194.301          0   2.465878          0          0   .0000447 
deal_amount1 |       384        384   195.7253   68164.96   261.0842   2.584754   10.32427    75158.5      3.441       1500      3.441         10         15 
maturity_y~r |       384        384   5.005729   8.640364    2.93945   1.422179   5.696268     1922.2   .3424658   14.79726   .3424658   1.032877   1.950685 
interest_s~1 |       384        384    6.58893   10.70495   3.271841   .6274683   2.623947   2530.149       1.03         15        1.5       2.38       2.82 
    floating |       384        384   .7369792    .194347    .440848  -1.076509   2.158871        283          0          1          0          0          0 
 asset_based |       384        384   .0130208   .0128848   .1135114    8.59146   74.81319          5          0          1          0          0          0 
 second_lien |       384        384   .0260417   .0254297    .159467   5.952036   36.42674         10          0          1          0          0          0 

             |    e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+------------------------------------------------------------------
  monthly_fs |         0          0          1          1          1          1 
projected_fs |         0          1          1          1          1          1 
lender_mee~g |         0          0          0          1          1          1 
         atq |  336.1315    799.825   1792.235     3699.3   5957.984      14046 
       revtq |    34.477     83.544    211.547    459.019      674.1      956.7 
         niq |  -18.2865    -1.2365      8.027     33.407     71.402    310.342 
         roa | -.0278859  -.0016729   .0092357   .0237352   .0331959   .1513436 
    leverage |   .512858   .6832068   .8880729   1.194894   1.382623   1.633763 
 prev_ebitda |      .242     39.627    128.568    275.909    434.773        958 
        xrdq |         0          0          0   .0111176   .0302735    .074387 
      ppegtq |   .074126   .3301814   .8048579   1.102276   1.665056   2.465878 
deal_amount1 |        39        100        250        500        750       1301 
maturity_y~r |   2.99726   4.958904    5.99589   8.668493   10.53699   14.79726 
interest_s~1 |      4.04   5.846177          9      11.29      12.57         15 
    floating |         0          1          1          1          1          1 
 asset_based |         0          0          0          0          0          1 
 second_lien |         0          0          0          0          0          1 

. esttab using "$tabdir/summary_table_by_other_nonbank.tex", replace ///
>      cells("count(fmt(%9.0fc)) mean(fmt(%9.2f)) sd(fmt(%9.2f)) min(fmt(%9.2f)) p50(fmt(%9.2f))  max(fmt(%9.2f))") noobs nonum collabels(Count Mean "Std. Dev." Min M
> edian Max) title(": Summary Statistics for Other Nonbank Lenders") label
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/summary_table_by_other_nonbank.tex)

. 
. estpost sum monthly_fs-lender_meeting `all_borr_cov' `all_deal_vars' if lender_is_private_credit == 1, de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10) 
-------------+-----------------------------------------------------------------------------------------------------------------------------------------------
  monthly_fs |       284        284   .5316901   .2498756   .4998756  -.1270159   1.016133        151          0          1          0          0          0 
projected_fs |       284        284   .6619718   .2245558   .4738732   -.684815   1.468972        188          0          1          0          0          0 
lender_mee~g |       284        284   .3450704   .2267954   .4762304   .6517982   1.424841         98          0          1          0          0          0 
         atq |       284        284   1243.597    6799664   2607.616   5.559177   40.27264   353181.4     49.233   22847.97     49.233     58.958     83.807 
       revtq |       284        284   160.4879   36359.61    190.682   1.927851   6.445035   45578.58     11.538      937.3     11.538     12.737     16.828 
         niq |       284        284  -16.51805   3110.241   55.76954  -1.625064   11.53447  -4691.127   -267.709    223.324   -267.709   -106.392    -63.481 
         roa |       284        284  -.0318101   .0038208   .0618124  -.9257487   4.505032  -9.034062  -.2033918   .1513436  -.2033918  -.1867943  -.1107374 
    leverage |       284        284   .7715682   .0917283   .3028668   .6792471   3.625161   219.1254   .1703868   1.633763   .1781166   .3278826   .3903479 
 prev_ebitda |       284        284   50.84949   37264.53   193.0402    3.80994   23.13717   14441.25   -266.806   1388.789   -266.806   -133.605    -56.785 
        xrdq |       284        284   .0093017    .000368   .0191825   2.346095   7.594909   2.641692          0    .074387          0          0          0 
      ppegtq |       284        284   .5095557   .2640155   .5138244   1.620195   5.931315   144.7138          0   2.465878          0     .01677    .045613 
deal_amount1 |       284        284   140.3222   54148.84    232.699   5.591128   48.45548   39851.52       .005       2500      .0098   .0358549   .3123427 
maturity_y~r |       284        284   4.432578   4.342097    2.08377   1.590678    9.17364   1258.852   .3424658   14.79726   .4109589   1.342466   2.161644 
interest_s~1 |       284        284   7.836304   11.42551   3.380164   -.030564   2.321051    2225.51          1         15       1.03   2.108616     2.9987 
    floating |       284        284   .7183099   .2030558   .4506171  -.9706477   1.942157        204          0          1          0          0          0 
 asset_based |       284        284   .0140845   .0139352   .1180475   8.247077   69.01429          4          0          1          0          0          0 
 second_lien |       284        284   .0352113   .0340915   .1846388   5.043461    26.4365         10          0          1          0          0          0 

             |    e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+------------------------------------------------------------------
  monthly_fs |         0          1          1          1          1          1 
projected_fs |         0          1          1          1          1          1 
lender_mee~g |         0          0          1          1          1          1 
         atq |  202.5735   448.9165   1188.818   2542.365   4277.683   14923.05 
       revtq |    29.209    85.8955   199.3485    450.372    595.511        889 
         niq |   -23.903    -5.5465      2.137     15.487     32.643    150.554 
         roa | -.0612942   -.017405   .0058885   .0200053   .0342861   .1054692 
    leverage |  .5620905   .7573931   .9286752   1.129963   1.377563   1.633763 
 prev_ebitda |   -12.913     12.462     59.555        183      269.3   1022.166 
        xrdq |         0          0   .0101011   .0331291   .0625284    .074387 
      ppegtq |  .1130251    .329389   .8003834   1.128833   1.456794   2.465878 
deal_amount1 |        20      73.75        175        335        495       1000 
maturity_y~r |   2.99726   4.731507          5          6   7.989041   14.79726 
interest_s~1 |  5.281724    7.91345   10.36685   12.12942      13.25         15 
    floating |         0          1          1          1          1          1 
 asset_based |         0          0          0          0          0          1 
 second_lien |         0          0          0          0          0          1 

. esttab using "$tabdir/summary_table_by_private_credit.tex", replace ///
>      cells("count(fmt(%9.0fc)) mean(fmt(%9.2f)) sd(fmt(%9.2f)) min(fmt(%9.2f)) p50(fmt(%9.2f))  max(fmt(%9.2f))") noobs nonum collabels(Count Mean "Std. Dev." Min M
> edian Max) title(": Summary Statistics for Direct Lenders") label
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/summary_table_by_private_credit.tex)

. 
. /**************
>         Figure 1 & 2 (Number of Deals by Bank, Private Credit, and Other Nonbank Direct Lender)
>         ***************/
.         
.         use "$intdir/intermediate_data_after_main_regression.dta", clear

. 
. gen lender_type = lender_is_private_credit + 1
(384 missing values generated)

. replace lender_type = 3 if lender_type == .
(384 real changes made)

.         
. collapse (count) deal_amount1 (mean) monthly_fs projected_fs lender_meeting, by(year lender_type)

. label define lender_type_lab 1 "Bank" 2 "Private Credit" 3 "Other Nonbank Lender"

. label values lender_type lender_type_lab

. 
. reshape wide deal_amount1 monthly_fs-lender_meeting, i(year) j(lender_type)
(j = 1 2 3)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               42   ->   14          
Number of variables                   6   ->   13          
j variable (3 values)       lender_type   ->   (dropped)
xij variables:
                           deal_amount1   ->   deal_amount11 deal_amount12 deal_amount13
                             monthly_fs   ->   monthly_fs1 monthly_fs2 monthly_fs3
                           projected_fs   ->   projected_fs1 projected_fs2 projected_fs3
                         lender_meeting   ->   lender_meeting1 lender_meeting2 lender_meeting3
-----------------------------------------------------------------------------

. 
. tsset year

Time variable: year, 2010 to 2023
        Delta: 1 unit

. 
. * generate shares of deals 
. gen count = deal_amount11+deal_amount12+deal_amount13

. gen share1 = deal_amount11/count

. gen share2 = deal_amount12/count

. gen share3 = deal_amount13/count

. 
. *** Figure 1: Number of Deals (in sample) by Year
. twoway (tsline deal_amount11, lcolor(blue) lpattern(solid)) ///
>        (tsline deal_amount12, lcolor(red) lpattern(dash)) ///
>        (tsline deal_amount13, lcolor(green) lpattern(longdash)) ///
>        , ///
>        title("Number of Deals by Lender Types Over Time") ///
>        legend(order(1 "Bank" 2 "Private Credit" 3 "Other Nonbank Lender") position(1) ring(0)) ///
>        ytitle("Deal Count") xtitle("Year") ///
>        xlabel(2010(2)2023) ///
>        graphregion(color(white)) plotregion(color(white)) 

.            
. graph export "$figdir/Figure1.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure1.pdf saved as PDF format

. 
. *** Figure 1A: Share of Deals (in sample) by year
. twoway (tsline share2, lcolor(red) lpattern(dash)) ///
>        (tsline share3, lcolor(green) lpattern(longdash)) ///
>        , ///
>        title("Share of Deals by Lender Types Over Time") ///
>        legend(order(1 "Private Credit" 2 "Other Nonbank Lender") position(1) ring(0)) ///
>        ytitle("Deal Count") xtitle("Year") ///
>        xlabel(2010(2)2023) ///
>        graphregion(color(white)) plotregion(color(white)) 

.            
. graph export "$figdir/Figure1A.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure1A.pdf saved as PDF format

.            
. *** Figure 2: Usage of different information covenants:
. * Monthly FS
. twoway (tsline monthly_fs1, lcolor(blue) lpattern(solid)) ///
>        (tsline monthly_fs2, lcolor(red) lpattern(dash)) ///
>        (tsline monthly_fs3, lcolor(green) lpattern(longdash)) ///
>        , ///
>        title("Use of Monthly Financial Statement Covenant by Lender Types") ///
>        legend(order(1 "Bank" 2 "Private Credit" 3 "Other Nonbank Lender") position(1) ring(0)) ///
>        ytitle("Frequency") xtitle("Year") ///
>        xlabel(2010(2)2023) ///
>        graphregion(color(white)) plotregion(color(white))

.            
. graph export "$figdir/Figure2_monthlyfs.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure2_monthlyfs.pdf saved as PDF format

.            
. * Projected FS
. twoway (tsline projected_fs1, lcolor(blue) lpattern(solid)) ///
>        (tsline projected_fs2, lcolor(red) lpattern(dash)) ///
>        (tsline projected_fs3, lcolor(green) lpattern(longdash)) ///
>        , ///
>        title("Use of Annual Budget/Project Covenant by Lender Types") ///
>        legend(order(1 "Bank" 2 "Private Credit" 3 "Other Nonbank Lender") position(1) ring(0)) ///
>        ytitle("Frequency") xtitle("Year") ///
>        xlabel(2010(2)2023) ///
>        graphregion(color(white)) plotregion(color(white))

.            
. graph export "$figdir/Figure2_projectedfs.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure2_projectedfs.pdf saved as PDF format

. 
. * Lender Meeting
. twoway (tsline lender_meeting1, lcolor(blue) lpattern(solid)) ///
>        (tsline lender_meeting2, lcolor(red) lpattern(dash)) ///
>        (tsline lender_meeting3, lcolor(green) lpattern(longdash)) ///
>        , ///
>        title("Use of Lender Meeting Covenant by Lender Types") ///
>        legend(order(1 "Bank" 2 "Private Credit" 3 "Other Nonbank Lender") position(1) ring(0)) ///
>        ytitle("Frequency") xtitle("Year") ///
>        xlabel(2010(2)2023) ///
>        graphregion(color(white)) plotregion(color(white))

. 
. graph export "$figdir/Figure2_lendermeeting.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure2_lendermeeting.pdf saved as PDF format

. 
. /**************
>         Determinant Tables
>         ***************/
.         
. use "$intdir/intermediate_data_after_main_regression.dta", clear

. 
. la var lender_is_nonbank "Nonbank Lender"

. la var lender_is_other_nonbank "Other Nonbank Lender"

. la var lender_is_private_credit "Private Credit Lender"

. la var monthly_fs "Monthly Financial Statement"

. la var projected_fs "Annual Budget/Projection"

. la var lender_meeting "Lender Meeting"

. la var atq "Total Assets (Million USD)"

. la var revtq "Revenue (Million USD)"

. la var niq "Net Income (Million USD)"

. la var ibq "Income Before Extraordinary Items (Million USD)"

. la var ltq "Long-Term Debt (Million USD)"

. la var xrdq "R\&D Intensity"

. la var ppegtq "Tangibility"

. la var roa "ROA"

. la var leverage "Leverage Ratio"

. la var prev_ebitda "EBITDA (Million USD)"

. la var maturity_year "Maturity (Years)"

. la var margin_bps "Floating Interest Margin (Basis Points)"

. la var deal_amount1 "Deal Amount (Million USD)"

. la var interest_spread1 "Interest Margin (Percentage)"

. la var floating "Floating Rate"

. la var asset_based "Asset Based Loan"

. 
. gen ln_deal_amount = ln(deal_amount1)

. la var ln_deal_amount "Ln(Deal Amount)"

. 
. gen scaled_ebitda = prev_ebitda/atq

. la var scaled_ebitda "EBITDA (Scaled)"

. 
. gen ln_atq = log(atq)

. la var ln_atq "Ln(Total Assets)"

.         
. gen prev_ebitda_dummy = 1 if prev_ebitda < 0 
(2,584 missing values generated)

. replace prev_ebitda_dummy = 0 if prev_ebitda_dummy == .
(2,584 real changes made)

. la var prev_ebitda_dummy "EBITDA < 0"

. 
. gen debt_to_ebitda = ltq/prev_ebitda

. replace debt_to_ebitda = 0 if debt_to_ebitda < 0 /// according to Chernenko et al 2022
> 
(423 real changes made)

. * winsorize at 5 and 95% according to chernenko et al
. winsor2 debt_to_ebitda, cuts(5 95) replace

. 
. gen debt_to_ebitda_gr6 = 1 if debt_to_ebitda > 6
(1,436 missing values generated)

. replace debt_to_ebitda_gr6 = 1 if debt_to_ebitda == 0
(423 real changes made)

. replace debt_to_ebitda_gr6 = 0 if debt_to_ebitda_gr6 == .
(1,013 real changes made)

. 
. save "$cleandir/final_regression_sample.dta", replace
file /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Data/Cleaned/final_regression_sample.dta saved

. 
. 
. *** Determinant Regressions (Table III)
. 
. local borr_vars "scaled_ebitda ln_atq roa leverage"

. local deal_vars "ln_deal_amount maturity_year interest_spread1" 

. local y_vars "lender_is_nonbank lender_is_private_credit lender_is_other_nonbank" 

. local info_vars "monthly_fs projected_fs lender_meeting hard_info info_n all_info"

.         
. foreach var of varlist `y_vars' {
  2.         eststo: reghdfe `var' `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }       
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =     142.46
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2863
                                                  Adj R-squared   =     0.2788
                                                  Within R-sq.    =     0.2511
                                                  Root MSE        =     0.3531

----------------------------------------------------------------------------------
lender_is_nonb~k | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.2614266   .0611964    -4.27   0.000    -.3814182    -.141435
          ln_atq |   .0005034   .0068189     0.07   0.941    -.0128669    .0138737
             roa |  -.6533974   .1720065    -3.80   0.000    -.9906612   -.3161335
        leverage |   .1255893   .0258877     4.85   0.000     .0748297     .176349
  ln_deal_amount |  -.0727857    .005332   -13.65   0.000    -.0832405   -.0623308
   maturity_year |   .0170345   .0030004     5.68   0.000     .0111515    .0229175
interest_spread1 |   .0467308   .0026071    17.92   0.000      .041619    .0518427
           _cons |   .2036408   .0444481     4.58   0.000     .1164886     .290793
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   7,   2591) =     149.60
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3228
                                                  Adj R-squared   =     0.3147
                                                  Within R-sq.    =     0.2878
                                                  Root MSE        =     0.2573

----------------------------------------------------------------------------------
lender_is_priv~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.2341207   .0505631    -4.63   0.000     -.333269   -.1349725
          ln_atq |   .0065567   .0053196     1.23   0.218    -.0038744    .0169877
             roa |   -.704424    .138382    -5.09   0.000    -.9757746   -.4330734
        leverage |   .1053192   .0208272     5.06   0.000     .0644796    .1461587
  ln_deal_amount |  -.0620645   .0041352   -15.01   0.000    -.0701731   -.0539559
   maturity_year |   .0060898   .0025264     2.41   0.016     .0011359    .0110437
interest_spread1 |    .039051   .0021088    18.52   0.000     .0349158    .0431861
           _cons |   .1110747   .0347208     3.20   0.001     .0429914     .179158
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   7,   2691) =      60.10
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1614
                                                  Adj R-squared   =     0.1517
                                                  Within R-sq.    =     0.1352
                                                  Root MSE        =     0.3206

----------------------------------------------------------------------------------
lender_is_othe~k | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.2133278   .0626929    -3.40   0.001    -.3362589   -.0903966
          ln_atq |   .0007025   .0071479     0.10   0.922    -.0133133    .0147184
             roa |  -.3888948   .1741138    -2.23   0.026     -.730305   -.0474846
        leverage |   .0991482   .0250839     3.95   0.000     .0499626    .1483337
  ln_deal_amount |  -.0505783    .006571    -7.70   0.000    -.0634631   -.0376935
   maturity_year |   .0158992    .002872     5.54   0.000     .0102676    .0215309
interest_spread1 |   .0320743   .0026931    11.91   0.000     .0267936     .037355
           _cons |   .1242911   .0429137     2.90   0.004     .0401439    .2084383
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)

. esttab using "$tabdir/Table3_treatment.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table3_treatment.tex)

. * clear storeed est
. eststo clear

. 
. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      37.11
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1192
                                                  Adj R-squared   =     0.1100
                                                  Within R-sq.    =     0.0803
                                                  Root MSE        =     0.4258

----------------------------------------------------------------------------------
      monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.1566518   .0738008    -2.12   0.034    -.3013576   -.0119459
          ln_atq |  -.0672448   .0082234    -8.18   0.000    -.0833689   -.0511207
             roa |  -.5466157   .2074342    -2.64   0.008    -.9533446   -.1398867
        leverage |   .0677618   .0312197     2.17   0.030     .0065474    .1289763
  ln_deal_amount |  -.0117283   .0064303    -1.82   0.068    -.0243365    .0008799
   maturity_year |  -.0217081   .0036183    -6.00   0.000    -.0288028   -.0146134
interest_spread1 |   .0040767    .003144     1.30   0.195     -.002088    .0102415
           _cons |   .8576744    .053603    16.00   0.000     .7525717    .9627771
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      17.72
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0999
                                                  Adj R-squared   =     0.0905
                                                  Within R-sq.    =     0.0400
                                                  Root MSE        =     0.4695

----------------------------------------------------------------------------------
    projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.0123854   .0813834    -0.15   0.879    -.1719588    .1471881
          ln_atq |  -.0952323   .0090683   -10.50   0.000    -.1130131   -.0774515
             roa |   .0186892   .2287467     0.08   0.935    -.4298285     .467207
        leverage |  -.0165505   .0344274    -0.48   0.631    -.0840543    .0509534
  ln_deal_amount |   .0301303   .0070909     4.25   0.000     .0162267    .0440339
   maturity_year |  -.0024593   .0039901    -0.62   0.538     -.010283    .0053643
interest_spread1 |   .0026274   .0034671     0.76   0.449    -.0041707    .0094255
           _cons |   1.111857   .0591103    18.81   0.000     .9959555    1.227758
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      27.39
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1081
                                                  Adj R-squared   =     0.0988
                                                  Within R-sq.    =     0.0605
                                                  Root MSE        =     0.3766

----------------------------------------------------------------------------------
  lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.0378422   .0652719    -0.58   0.562    -.1658248    .0901404
          ln_atq |  -.0209456    .007273    -2.88   0.004    -.0352063   -.0066849
             roa |  -.1692767   .1834616    -0.92   0.356    -.5290011    .1904478
        leverage |   .1812661   .0276118     6.56   0.000      .127126    .2354061
  ln_deal_amount |   .0269533   .0056871     4.74   0.000     .0158022    .0381044
   maturity_year |   .0052024   .0032002     1.63   0.104    -.0010724    .0114772
interest_spread1 |   .0209351   .0027807     7.53   0.000     .0154828    .0263873
           _cons |  -.0385876   .0474082    -0.81   0.416    -.1315439    .0543686
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      24.07
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0948
                                                  Adj R-squared   =     0.0854
                                                  Within R-sq.    =     0.0536
                                                  Root MSE        =     0.4525

----------------------------------------------------------------------------------
       hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |   -.036127   .0784368    -0.46   0.645    -.1899228    .1176688
          ln_atq |  -.1006298     .00874   -11.51   0.000    -.1177668   -.0834928
             roa |  -.1162857   .2204645    -0.53   0.598    -.5485641    .3159927
        leverage |   .0250919   .0331809     0.76   0.450    -.0399678    .0901517
  ln_deal_amount |   .0286884   .0068342     4.20   0.000     .0152882    .0420887
   maturity_year |  -.0106034   .0038456    -2.76   0.006    -.0181438    -.003063
interest_spread1 |   .0030766   .0033415     0.92   0.357    -.0034753    .0096286
           _cons |    1.24022   .0569702    21.77   0.000     1.128515    1.351925
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      37.79
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1342
                                                  Adj R-squared   =     0.1252
                                                  Within R-sq.    =     0.0817
                                                  Root MSE        =     0.8228

----------------------------------------------------------------------------------
          info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.2068793   .1426079    -1.45   0.147    -.4864995    .0727408
          ln_atq |  -.1834227   .0158903   -11.54   0.000    -.2145799   -.1522655
             roa |  -.6972031   .4008323    -1.74   0.082     -1.48314    .0887335
        leverage |   .2324774    .060327     3.85   0.000     .1141906    .3507642
  ln_deal_amount |   .0453553   .0124254     3.65   0.000      .020992    .0697186
   maturity_year |  -.0189651   .0069919    -2.71   0.007    -.0326744   -.0052557
interest_spread1 |   .0276392   .0060754     4.55   0.000     .0157269    .0395515
           _cons |   1.930944   .1035789    18.64   0.000      1.72785    2.134037
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   7,   2975) =      11.69
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0515
                                                  Adj R-squared   =     0.0416
                                                  Within R-sq.    =     0.0268
                                                  Root MSE        =     0.2335

----------------------------------------------------------------------------------
        all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   scaled_ebitda |  -.0091642   .0404697    -0.23   0.821    -.0885157    .0701872
          ln_atq |  -.0161566   .0045094    -3.58   0.000    -.0249985   -.0073148
             roa |   .0103043   .1137494     0.09   0.928    -.2127312    .2333397
        leverage |   .0460179   .0171198     2.69   0.007     .0124501    .0795857
  ln_deal_amount |   .0013467   .0035261     0.38   0.703    -.0055672    .0082606
   maturity_year |  -.0042395   .0019842    -2.14   0.033      -.00813    -.000349
interest_spread1 |   .0092215   .0017241     5.35   0.000      .005841     .012602
           _cons |   .1101793   .0293939     3.75   0.000     .0525448    .1678138
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est6 stored)

. esttab using "$tabdir/Table3_infocov.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table3_infocov.tex)

. * clear storeed est
. eststo clear

. 
. /**************
>         Main Regression Table 
>         ***************/
.         
. *** Main (Table IV-All (all nonbank lenders))
. 
. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' lender_is_nonbank `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      36.70
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1283
                                                  Adj R-squared   =     0.1189
                                                  Within R-sq.    =     0.0899
                                                  Root MSE        =     0.4236

-----------------------------------------------------------------------------------
       monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .1229494   .0219986     5.59   0.000     .0798152    .1660835
    scaled_ebitda |  -.1245096   .0736535    -1.69   0.091    -.2689265    .0199074
           ln_atq |  -.0673067   .0081819    -8.23   0.000    -.0833495   -.0512639
              roa |  -.4662809   .2068879    -2.25   0.024    -.8719389   -.0606229
         leverage |   .0523207   .0311849     1.68   0.093    -.0088255    .1134669
   ln_deal_amount |  -.0027793   .0065952    -0.42   0.673    -.0157109    .0101522
    maturity_year |  -.0238025   .0036196    -6.58   0.000    -.0308996   -.0167054
 interest_spread1 |  -.0016688   .0032928    -0.51   0.612    -.0081251    .0047876
            _cons |   .8326369   .0535205    15.56   0.000      .727696    .9375778
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      15.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1006
                                                  Adj R-squared   =     0.0909
                                                  Within R-sq.    =     0.0408
                                                  Root MSE        =     0.4694

-----------------------------------------------------------------------------------
     projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0378827    .024376    -1.55   0.120    -.0856783     .009913
    scaled_ebitda |  -.0222889   .0816132    -0.27   0.785     -.182313    .1377352
           ln_atq |  -.0952132   .0090661   -10.50   0.000    -.1129898   -.0774367
              roa |  -.0060632   .2292462    -0.03   0.979    -.4555605    .4434341
         leverage |  -.0117928    .034555    -0.34   0.733     -.079547    .0559614
   ln_deal_amount |    .027373   .0073079     3.75   0.000     .0130439     .041702
    maturity_year |   -.001814   .0040107    -0.45   0.651    -.0096781      .00605
 interest_spread1 |   .0043977   .0036486     1.21   0.228    -.0027564    .0115518
            _cons |   1.119571   .0593044    18.88   0.000     1.003289    1.235853
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      24.61
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1096
                                                  Adj R-squared   =     0.1000
                                                  Within R-sq.    =     0.0621
                                                  Root MSE        =     0.3763

-----------------------------------------------------------------------------------
   lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0431976   .0195422     2.21   0.027       .00488    .0815152
    scaled_ebitda |  -.0265492   .0654291    -0.41   0.685      -.15484    .1017416
           ln_atq |  -.0209673   .0072683    -2.88   0.004    -.0352188   -.0067159
              roa |  -.1410515    .183786    -0.77   0.443     -.501412    .2193091
         leverage |   .1758409   .0277027     6.35   0.000     .1215225    .2301592
   ln_deal_amount |   .0300975   .0058587     5.14   0.000     .0186099     .041585
    maturity_year |   .0044665   .0032154     1.39   0.165    -.0018381    .0107711
 interest_spread1 |   .0189164   .0029251     6.47   0.000      .013181    .0246518
            _cons |  -.0473844   .0475442    -1.00   0.319    -.1406072    .0458383
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      21.18
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0951
                                                  Adj R-squared   =     0.0853
                                                  Within R-sq.    =     0.0539
                                                  Root MSE        =     0.4525

-----------------------------------------------------------------------------------
        hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0224923   .0234994    -0.96   0.339     -.068569    .0235844
    scaled_ebitda |  -.0420071   .0786781    -0.53   0.593    -.1962761    .1122619
           ln_atq |  -.1006185   .0087401   -11.51   0.000    -.1177557   -.0834812
              roa |  -.1309821   .2210017    -0.59   0.553    -.5643138    .3023496
         leverage |   .0279167   .0333123     0.84   0.402    -.0374008    .0932343
   ln_deal_amount |   .0270513   .0070451     3.84   0.000     .0132376     .040865
    maturity_year |  -.0102202   .0038665    -2.64   0.008    -.0178015    -.002639
 interest_spread1 |   .0041277   .0035174     1.17   0.241    -.0027691    .0110245
            _cons |     1.2448   .0571716    21.77   0.000       1.1327      1.3569
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      34.29
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1369
                                                  Adj R-squared   =     0.1276
                                                  Within R-sq.    =     0.0844
                                                  Root MSE        =     0.8217

-----------------------------------------------------------------------------------
           info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .1282643   .0426666     3.01   0.003     .0446052    .2119235
    scaled_ebitda |  -.1733476   .1428518    -1.21   0.225     -.453446    .1067508
           ln_atq |  -.1834872   .0158689   -11.56   0.000    -.2146025    -.152372
              roa |  -.6133955   .4012615    -1.53   0.126    -1.400174    .1733828
         leverage |   .2163688   .0604835     3.58   0.000     .0977751    .3349625
   ln_deal_amount |   .0546911   .0127914     4.28   0.000     .0296102     .079772
    maturity_year |    -.02115   .0070202    -3.01   0.003    -.0349148   -.0073851
 interest_spread1 |   .0216453   .0063864     3.39   0.001     .0091231    .0341675
            _cons |   1.904824   .1038036    18.35   0.000      1.70129    2.108358
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   8,   2974) =      16.92
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0678
                                                  Adj R-squared   =     0.0578
                                                  Within R-sq.    =     0.0435
                                                  Root MSE        =     0.2315

-----------------------------------------------------------------------------------
         all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0868026   .0120215     7.22   0.000     .0632313     .110374
    scaled_ebitda |   .0135283   .0402492     0.34   0.737    -.0653908    .0924474
           ln_atq |  -.0162003   .0044712    -3.62   0.000    -.0249672   -.0074335
              roa |   .0670209   .1130574     0.59   0.553    -.1546577    .2886995
         leverage |   .0351164   .0170415     2.06   0.039     .0017021    .0685308
   ln_deal_amount |   .0076647    .003604     2.13   0.034      .000598    .0147314
    maturity_year |  -.0057182    .001978    -2.89   0.004    -.0095965   -.0018398
 interest_spread1 |   .0051651   .0017994     2.87   0.004      .001637    .0086933
            _cons |   .0925028   .0292472     3.16   0.002     .0351561    .1498495
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est6 stored)

. esttab using "$tabdir/Table4_main_regression_all.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table4_main_regression_all.tex)

. * clear storeed est
. eststo clear

. 
. *** Main (Table IV)
. 
. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' lender_is_private_credit `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      36.68
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1394
                                                  Adj R-squared   =     0.1287
                                                  Within R-sq.    =     0.1018
                                                  Root MSE        =     0.4164

------------------------------------------------------------------------------------------
              monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .1860975   .0317999     5.85   0.000     .1237416    .2484534
           scaled_ebitda |   -.219308   .0821833    -2.67   0.008    -.3804597   -.0581564
                  ln_atq |  -.0698669   .0086132    -8.11   0.000    -.0867563   -.0529775
                     roa |   -.676663   .2251131    -3.01   0.003    -1.118083   -.2352432
                leverage |   .0589257   .0338784     1.74   0.082    -.0075058    .1253572
          ln_deal_amount |   .0003443   .0069784     0.05   0.961    -.0133396    .0140281
           maturity_year |  -.0206992   .0040939    -5.06   0.000    -.0287269   -.0126714
        interest_spread1 |  -.0024953   .0036324    -0.69   0.492     -.009618    .0046273
                   _cons |    .827935   .0563126    14.70   0.000     .7175128    .9383573
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      15.91
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1088
                                                  Adj R-squared   =     0.0978
                                                  Within R-sq.    =     0.0468
                                                  Root MSE        =     0.4663

------------------------------------------------------------------------------------------
            projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .0095028   .0356039     0.27   0.790    -.0603123    .0793179
           scaled_ebitda |  -.0188889   .0920143    -0.21   0.837     -.199318    .1615401
                  ln_atq |  -.0980918   .0096435   -10.17   0.000    -.1170016    -.079182
                     roa |   -.180166   .2520417    -0.71   0.475    -.6743897    .3140576
                leverage |  -.0015921    .037931    -0.04   0.967    -.0759704    .0727861
          ln_deal_amount |   .0247886   .0078132     3.17   0.002     .0094678    .0401094
           maturity_year |   .0050546   .0045837     1.10   0.270    -.0039335    .0140426
        interest_spread1 |   .0048962   .0040669     1.20   0.229    -.0030785    .0128709
                   _cons |   1.114531   .0630489    17.68   0.000     .9908999    1.238162
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      23.40
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1138
                                                  Adj R-squared   =     0.1029
                                                  Within R-sq.    =     0.0674
                                                  Root MSE        =     0.3715

------------------------------------------------------------------------------------------
          lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .0756058   .0283703     2.66   0.008     .0199751    .1312365
           scaled_ebitda |  -.1308765   .0733197    -1.79   0.074    -.2746477    .0128947
                  ln_atq |  -.0251338   .0076842    -3.27   0.001    -.0402017   -.0100659
                     roa |  -.2199832   .2008343    -1.10   0.273    -.6137953    .1738289
                leverage |    .169339   .0302246     5.60   0.000     .1100722    .2286058
          ln_deal_amount |   .0267143   .0062258     4.29   0.000     .0145063    .0389224
           maturity_year |   .0086464   .0036524     2.37   0.018     .0014845    .0158083
        interest_spread1 |   .0191738   .0032406     5.92   0.000     .0128193    .0255283
                   _cons |  -.0074192   .0502392    -0.15   0.883    -.1059322    .0910939
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      21.03
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1054
                                                  Adj R-squared   =     0.0944
                                                  Within R-sq.    =     0.0610
                                                  Root MSE        =     0.4481

------------------------------------------------------------------------------------------
               hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .0433052   .0342199     1.27   0.206    -.0237959    .1104063
           scaled_ebitda |  -.0651339   .0884374    -0.74   0.461    -.2385491    .1082812
                  ln_atq |  -.1025253   .0092686   -11.06   0.000       -.1207   -.0843506
                     roa |  -.3213035    .242244    -1.33   0.185    -.7963151     .153708
                leverage |   .0341272   .0364565     0.94   0.349    -.0373597     .105614
          ln_deal_amount |   .0260646   .0075095     3.47   0.001     .0113394    .0407898
           maturity_year |  -.0039239   .0044055    -0.89   0.373    -.0125625    .0047147
        interest_spread1 |   .0047266   .0039088     1.21   0.227    -.0029381    .0123912
                   _cons |   1.230449   .0605979    20.31   0.000     1.111624    1.349274
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      40.19
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1648
                                                  Adj R-squared   =     0.1545
                                                  Within R-sq.    =     0.1104
                                                  Root MSE        =     0.7923

------------------------------------------------------------------------------------------
                  info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .2712061   .0605001     4.48   0.000     .1525727    .3898395
           scaled_ebitda |  -.3690735   .1563554    -2.36   0.018    -.6756678   -.0624792
                  ln_atq |  -.1930925   .0163868   -11.78   0.000     -.225225     -.16096
                     roa |  -1.076812   .4282823    -2.51   0.012    -1.916623   -.2370019
                leverage |   .2266725   .0644544     3.52   0.000     .1002852    .3530598
          ln_deal_amount |   .0518472   .0132766     3.91   0.000     .0258133     .077881
           maturity_year |  -.0069982   .0077888    -0.90   0.369    -.0222711    .0082747
        interest_spread1 |   .0215747   .0069107     3.12   0.002     .0080237    .0351257
                   _cons |   1.935047   .1071359    18.06   0.000     1.724966    2.145128
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,623
Absorbing 2 HDFE groups                           F(   8,   2590) =      20.84
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0808
                                                  Adj R-squared   =     0.0694
                                                  Within R-sq.    =     0.0605
                                                  Root MSE        =     0.2219

------------------------------------------------------------------------------------------
                all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
lender_is_private_credit |   .1542922   .0169458     9.11   0.000     .1210635    .1875208
           scaled_ebitda |  -.0300042   .0437944    -0.69   0.493    -.1158798    .0558714
                  ln_atq |  -.0185545   .0045899    -4.04   0.000    -.0275547   -.0095544
                     roa |  -.0619653   .1199599    -0.52   0.606    -.2971923    .1732616
                leverage |   .0221552   .0180534     1.23   0.220    -.0132453    .0575557
          ln_deal_amount |   .0107738   .0037187     2.90   0.004     .0034818    .0180657
           maturity_year |  -.0037862   .0021816    -1.74   0.083     -.008064    .0004917
        interest_spread1 |   .0026956   .0019356     1.39   0.164    -.0010999    .0064912
                   _cons |   .1074611   .0300083     3.58   0.000     .0486185    .1663037
------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est6 stored)

. esttab using "$tabdir/Table4_main_regression_pc.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table4_main_regression_pc.tex)

. * clear storeed est
. eststo clear

. 
. *** Main (Table IV-1 (for other nonbanks))
. 
. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' lender_is_other_nonbank `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =      21.35
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1034
                                                  Adj R-squared   =     0.0927
                                                  Within R-sq.    =     0.0597
                                                  Root MSE        =     0.4173

-----------------------------------------------------------------------------------------
             monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |   .0797547   .0250916     3.18   0.001     .0305539    .1289554
          scaled_ebitda |  -.2303511   .0817778    -2.82   0.005    -.3907049   -.0699974
                 ln_atq |  -.0567147   .0093038    -6.10   0.000    -.0749581   -.0384714
                    roa |  -.4605332   .2268402    -2.03   0.042     -.905332   -.0157345
               leverage |   .0361273   .0327443     1.10   0.270    -.0280792    .1003339
         ln_deal_amount |  -.0053613   .0086466    -0.62   0.535     -.022316    .0115935
          maturity_year |  -.0203729   .0037595    -5.42   0.000    -.0277448    -.013001
       interest_spread1 |  -.0087183   .0035965    -2.42   0.015    -.0157706   -.0016661
                  _cons |   .8064451   .0559444    14.42   0.000     .6967467    .9161436
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =      17.15
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1081
                                                  Adj R-squared   =     0.0975
                                                  Within R-sq.    =     0.0485
                                                  Root MSE        =     0.4690

-----------------------------------------------------------------------------------------
           projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |  -.0732486   .0281983    -2.60   0.009     -.128541   -.0179561
          scaled_ebitda |  -.1543057   .0919031    -1.68   0.093    -.3345136    .0259021
                 ln_atq |  -.1174303   .0104558   -11.23   0.000    -.1379325   -.0969282
                    roa |   .0738344   .2549263     0.29   0.772    -.4260369    .5737057
               leverage |   .0190192   .0367985     0.52   0.605    -.0531371    .0911755
         ln_deal_amount |   .0591811   .0097172     6.09   0.000     .0401271    .0782351
          maturity_year |  -.0023153    .004225    -0.55   0.584    -.0105999    .0059694
       interest_spread1 |   .0008473   .0040419     0.21   0.834    -.0070782    .0087727
                  _cons |   1.121307   .0628712    17.83   0.000     .9980264    1.244588
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =      19.26
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1027
                                                  Adj R-squared   =     0.0920
                                                  Within R-sq.    =     0.0542
                                                  Root MSE        =     0.3661

-----------------------------------------------------------------------------------------
         lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |   .0086763   .0220132     0.39   0.694    -.0344882    .0518408
          scaled_ebitda |  -.0669955   .0717449    -0.93   0.350    -.2076763    .0736853
                 ln_atq |  -.0248082   .0081624    -3.04   0.002    -.0408134    -.008803
                    roa |  -.1579998   .1990104    -0.79   0.427    -.5482285    .2322289
               leverage |   .1813299   .0287271     6.31   0.000     .1250005    .2376594
         ln_deal_amount |   .0349263   .0075858     4.60   0.000     .0200516    .0498009
          maturity_year |   .0054904   .0032983     1.66   0.096    -.0009771    .0119578
       interest_spread1 |   .0185144   .0031553     5.87   0.000     .0123273    .0247015
                  _cons |  -.0501407   .0490809    -1.02   0.307    -.1463808    .0460994
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =      21.63
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1041
                                                  Adj R-squared   =     0.0934
                                                  Within R-sq.    =     0.0604
                                                  Root MSE        =     0.4544

-----------------------------------------------------------------------------------------
              hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |  -.0625342   .0273237    -2.29   0.022    -.1161117   -.0089567
          scaled_ebitda |  -.1943135   .0890527    -2.18   0.029     -.368932   -.0196949
                 ln_atq |  -.1256561   .0101315   -12.40   0.000    -.1455224   -.1057899
                    roa |   .0150676   .2470196     0.06   0.951    -.4692998     .499435
               leverage |    .044391   .0356572     1.24   0.213    -.0255273    .1143093
         ln_deal_amount |   .0634912   .0094158     6.74   0.000     .0450282    .0819542
          maturity_year |  -.0110435    .004094    -2.70   0.007    -.0190712   -.0030159
       interest_spread1 |  -.0013002   .0039165    -0.33   0.740    -.0089798    .0063794
                  _cons |   1.262447   .0609212    20.72   0.000      1.14299    1.381904
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =      23.10
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1181
                                                  Adj R-squared   =     0.1076
                                                  Within R-sq.    =     0.0643
                                                  Root MSE        =     0.8036

-----------------------------------------------------------------------------------------
                 info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |   .0151824   .0483207     0.31   0.753     -.079567    .1099318
          scaled_ebitda |  -.4516523   .1574855    -2.87   0.004    -.7604571   -.1428476
                 ln_atq |  -.1989532    .017917   -11.10   0.000    -.2340858   -.1638207
                    roa |  -.5446986   .4368425    -1.25   0.213     -1.40128    .3118824
               leverage |   .2364765   .0630581     3.75   0.000     .1128293    .3601238
         ln_deal_amount |   .0887461   .0166515     5.33   0.000     .0560952    .1213971
          maturity_year |  -.0171978     .00724    -2.38   0.018    -.0313944   -.0030012
       interest_spread1 |   .0106433   .0069261     1.54   0.124    -.0029378    .0242244
                  _cons |   1.877611   .1077362    17.43   0.000     1.666357    2.088866
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,723
Absorbing 2 HDFE groups                           F(   8,   2690) =       5.76
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0441
                                                  Adj R-squared   =     0.0327
                                                  Within R-sq.    =     0.0168
                                                  Root MSE        =     0.2051

-----------------------------------------------------------------------------------------
               all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
lender_is_other_nonbank |   .0465751   .0123307     3.78   0.000     .0223964    .0707538
          scaled_ebitda |  -.0393616    .040188    -0.98   0.327    -.1181641    .0394409
                 ln_atq |   -.012485   .0045722    -2.73   0.006    -.0214503   -.0035197
                    roa |   .0736533   .1114759     0.66   0.509    -.1449339    .2922405
               leverage |   .0417297   .0160915     2.59   0.010     .0101767    .0732827
         ln_deal_amount |   .0075916   .0042492     1.79   0.074    -.0007405    .0159237
          maturity_year |   -.004068   .0018476    -2.20   0.028    -.0076908   -.0004453
       interest_spread1 |   .0024224   .0017674     1.37   0.171    -.0010433    .0058881
                  _cons |   .0714658   .0274927     2.60   0.009     .0175568    .1253748
-----------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est6 stored)

. esttab using "$tabdir/Table4_main_regression_other.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table4_main_regression_other.tex)

. * clear storeed est
. eststo clear

. 
. *** Main regression with lender_is_nonbank and lender_is_private_credit in the same table
. 
. gen nonbank_pc_inter = lender_is_nonbank * lender_is_private_credit
(384 missing values generated)

. replace nonbank_pc_inter = 0 if nonbank_pc_inter == .
(384 real changes made)

. la var nonbank_pc_inter "Nonbank Lender * Private Credit"

. 
. local borr_vars "scaled_ebitda ln_atq roa leverage"

. local deal_vars "ln_deal_amount maturity_year interest_spread1" 

. local y_vars "lender_is_nonbank lender_is_private_credit" 

. local info_vars "monthly_fs projected_fs lender_meeting hard_info info_n all_info"

. 
. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' lender_is_nonbank nonbank_pc_inter `borr_vars' `deal_vars', absorb(ff_12 year)
  3. }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      34.62
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1331
                                                  Adj R-squared   =     0.1235
                                                  Within R-sq.    =     0.0949
                                                  Root MSE        =     0.4225

-----------------------------------------------------------------------------------
       monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0735591   .0251024     2.93   0.003     .0243393    .1227789
 nonbank_pc_inter |   .1383301   .0341512     4.05   0.000     .0713678    .2052925
    scaled_ebitda |  -.1190019    .073476    -1.62   0.105    -.2630709    .0250672
           ln_atq |  -.0686485   .0081675    -8.41   0.000    -.0846631   -.0526339
              roa |  -.4278701   .2065719    -2.07   0.038    -.8329085   -.0228318
         leverage |   .0501799   .0311089     1.61   0.107    -.0108173    .1111771
   ln_deal_amount |   .0010508   .0066458     0.16   0.874    -.0119799    .0140816
    maturity_year |  -.0233532   .0036119    -6.47   0.000    -.0304353    -.016271
 interest_spread1 |  -.0031432   .0033044    -0.95   0.342    -.0096223     .003336
            _cons |    .827215   .0533992    15.49   0.000     .7225119     .931918
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      15.07
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1033
                                                  Adj R-squared   =     0.0933
                                                  Within R-sq.    =     0.0436
                                                  Root MSE        =     0.4688

-----------------------------------------------------------------------------------
     projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0780318   .0278506    -2.80   0.005    -.1326402   -.0234233
 nonbank_pc_inter |   .1124478   .0378901     2.97   0.003     .0381544    .1867412
    scaled_ebitda |  -.0178117   .0815203    -0.22   0.827    -.1776536    .1420301
           ln_atq |   -.096304   .0090617   -10.63   0.000    -.1140719   -.0785361
              roa |   .0251607   .2291875     0.11   0.913    -.4242216     .474543
         leverage |   -.013533   .0345148    -0.39   0.695    -.0812083    .0541422
   ln_deal_amount |   .0304865   .0073733     4.13   0.000     .0160291    .0449439
    maturity_year |  -.0014487   .0040074    -0.36   0.718    -.0093062    .0064087
 interest_spread1 |   .0031992   .0036662     0.87   0.383    -.0039893    .0103876
            _cons |   1.115164   .0592453    18.82   0.000     .9989977     1.23133
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      22.79
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1119
                                                  Adj R-squared   =     0.1020
                                                  Within R-sq.    =     0.0645
                                                  Root MSE        =     0.3759

-----------------------------------------------------------------------------------
   lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |    .012859   .0223314     0.58   0.565    -.0309276    .0566456
 nonbank_pc_inter |   .0849711   .0303814     2.80   0.005     .0254004    .1445417
    scaled_ebitda |   -.023166   .0653653    -0.35   0.723    -.1513319    .1049998
           ln_atq |  -.0217916    .007266    -3.00   0.003    -.0360384   -.0075448
              roa |  -.1174572   .1837693    -0.64   0.523     -.477785    .2428707
         leverage |   .1745259   .0276749     6.31   0.000     .1202619    .2287899
   ln_deal_amount |   .0324502   .0059122     5.49   0.000     .0208579    .0440425
    maturity_year |   .0047426   .0032132     1.48   0.140    -.0015578    .0110429
 interest_spread1 |   .0180107   .0029396     6.13   0.000     .0122468    .0237747
            _cons |  -.0507149   .0475046    -1.07   0.286    -.1438602    .0424304
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      20.64
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0998
                                                  Adj R-squared   =     0.0898
                                                  Within R-sq.    =     0.0588
                                                  Root MSE        =     0.4514

-----------------------------------------------------------------------------------
        hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0738718   .0268187    -2.75   0.006    -.1264568   -.0212868
 nonbank_pc_inter |   .1439014   .0364861     3.94   0.000     .0723607    .2154421
    scaled_ebitda |  -.0362776   .0784997    -0.46   0.644    -.1901968    .1176417
           ln_atq |  -.1020143    .008726   -11.69   0.000    -.1191238   -.0849048
              roa |  -.0910244   .2206955    -0.41   0.680    -.5237558    .3417071
         leverage |   .0256897   .0332359     0.77   0.440     -.039478    .0908574
   ln_deal_amount |   .0310358   .0071001     4.37   0.000     .0171141    .0449574
    maturity_year |  -.0097528   .0038589    -2.53   0.012    -.0173191   -.0021865
 interest_spread1 |    .002594   .0035303     0.73   0.463    -.0043282    .0095161
            _cons |    1.23916   .0570501    21.72   0.000     1.127298    1.351021
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      33.60
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1443
                                                  Adj R-squared   =     0.1348
                                                  Within R-sq.    =     0.0923
                                                  Root MSE        =     0.8183

-----------------------------------------------------------------------------------
           info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0083863   .0486103     0.17   0.863    -.0869268    .1036995
 nonbank_pc_inter |    .335749   .0661331     5.08   0.000     .2060777    .4654202
    scaled_ebitda |  -.1599796   .1422849    -1.12   0.261    -.4389664    .1190072
           ln_atq |   -.186744   .0158163   -11.81   0.000    -.2177559   -.1557321
              roa |  -.5201666   .4000223    -1.30   0.194    -1.304515    .2641821
         leverage |   .2111727   .0602418     3.51   0.000     .0930529    .3292926
   ln_deal_amount |   .0639875   .0128694     4.97   0.000     .0387537    .0892213
    maturity_year |  -.0200594   .0069944    -2.87   0.004    -.0337737    -.006345
 interest_spread1 |   .0180667   .0063989     2.82   0.005       .00552    .0306134
            _cons |   1.891664   .1034064    18.29   0.000     1.688908    2.094419
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      19.10
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0787
                                                  Adj R-squared   =     0.0684
                                                  Within R-sq.    =     0.0547
                                                  Root MSE        =     0.2302

-----------------------------------------------------------------------------------
         all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0475101   .0136752     3.47   0.001     .0206963    .0743239
 nonbank_pc_inter |   .1100488   .0186048     5.92   0.000     .0735693    .1465283
    scaled_ebitda |   .0179099    .040028     0.45   0.655    -.0605755    .0963953
           ln_atq |  -.0172678   .0044495    -3.88   0.000    -.0259922   -.0085434
              roa |   .0975786   .1125355     0.87   0.386    -.1230767    .3182339
         leverage |   .0334133   .0169474     1.97   0.049     .0001835    .0666432
   ln_deal_amount |   .0107118   .0036205     2.96   0.003      .003613    .0178107
    maturity_year |  -.0053607   .0019677    -2.72   0.006    -.0092188   -.0015025
 interest_spread1 |   .0039922   .0018002     2.22   0.027     .0004625    .0075219
            _cons |   .0881893   .0290906     3.03   0.002     .0311496    .1452291
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ff_12 |        12           0          12     |
        year |        14           1          13     |
-----------------------------------------------------+
(est6 stored)

. esttab using "$tabdir/Table4_main_regression.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table4_main_regression.tex)

. * clear storeed est
. eststo clear

. 
. *** Propensity Score Matching
. 
.         use "$cleandir/final_regression_sample.dta", clear

. 
. foreach var of varlist `info_vars' {
  2.         eststo: psmatch2 lender_is_nonbank `borr_vars' i.ff_12 `deal_vars', out(`var') logit n(1) ai(3) common caliper(0.01)
  3. }

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      monthly_fs  Unmatched | .431137725    .24283882   .188298905   .019502835     9.65
                        ATT |   .4234375     .2890625      .134375   .035180114     3.82
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est1 stored)

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    projected_fs  Unmatched | .588323353   .587430526   .000892827    .02160247     0.04
                        ATT |   .5828125      .590625    -.0078125   .037190154    -0.21
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est2 stored)

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  lender_meeting  Unmatched | .281437126   .171013254   .110423872   .017288322     6.39
                        ATT |    .284375     .2171875     .0671875   .037060686     1.81
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est3 stored)

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       hard_info  Unmatched | .687125749   .654553228   .032572521   .020753125     1.57
                        ATT |   .6765625     .6921875     -.015625     .0344201    -0.45
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est4 stored)

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
          info_n  Unmatched |  1.3008982    1.0012826   .299615604   .038208714     7.84
                        ATT |   1.290625     1.096875       .19375   .067896124     2.85
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est5 stored)

Logistic regression                                     Number of obs =  3,007
                                                        LR chi2(18)   = 814.27
                                                        Prob > chi2   = 0.0000
Log likelihood = -1185.4131                             Pseudo R2     = 0.2557

-------------------------------------------------------------------------------------------------------------
                          lender_is_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -2.026233   .4704301    -4.31   0.000    -2.948259   -1.104206
                                     ln_atq |   .0093687   .0532669     0.18   0.860    -.0950326      .11377
                                        roa |   -4.22749   1.282944    -3.30   0.001    -6.742015   -1.712966
                                   leverage |   .8972476   .1997607     4.49   0.000     .5057238    1.288771
                                            |
                                      ff_12 |
                         Consumer Durables  |   .0453061   .4433336     0.10   0.919    -.8236118     .914224
                             Manufacturing  |  -.3580668   .3058071    -1.17   0.242    -.9574377    .2413042
Oil, Gas, and Coal Extraction and Products  |   .3250634   .3045118     1.07   0.286    -.2717687    .9218955
             Chemicals and Allied Products  |   .3160295   .3989867     0.79   0.428      -.46597    1.098029
                        Business Equipment  |  -.0883022   .2914579    -0.30   0.762    -.6595491    .4829447
     Telephone and Television Transmission  |     .47556   .3898156     1.22   0.222    -.2884646    1.239585
                                 Utilities  |   .6070346   .4203453     1.44   0.149     -.216827    1.430896
      Wholesale, Retail, and Some Services  |   .4644512   .2938414     1.58   0.114    -.1114674     1.04037
  Healthcare, Medical Equipment, and Drugs  |   .7026592   .3004222     2.34   0.019     .1138426    1.291476
                                   Finance  |   .4820323    .275394     1.75   0.080    -.0577299    1.021795
                                     Other  |    .375866   .2677653     1.40   0.160    -.1489444    .9006764
                                            |
                             ln_deal_amount |  -.4836411   .0436901   -11.07   0.000    -.5692722   -.3980101
                              maturity_year |   .1195729   .0219181     5.46   0.000     .0766141    .1625316
                           interest_spread1 |   .2882844   .0191319    15.07   0.000     .2507866    .3257823
                                      _cons |  -1.985076    .409722    -4.84   0.000    -2.788116   -1.182035
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
        all_info  Unmatched | .139221557   .038050449   .101171108   .010300486     9.82
                        ATT |    .140625     .0390625     .1015625   .016937097     6.00
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        640 |       668 
-----------+----------------------+----------
     Total |        28      2,979 |     3,007 
(est6 stored)

. estadd scalar r(att)

added scalar:
                e(att) =  .1015625

. estadd scalar r(seatt)

added scalar:
              e(seatt) =  .0169371

. esttab using "$tabdir/Table5_main_psm_all.tex", replace obslast nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses star(* 0.10 ** 0.05 *** 0.01) pla
> in lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table5_main_psm_all.tex)

. eststo clear

. 
. pstest `borr_vars' `deal_vars', graph both graphregion(color(white)) bgcolor(white)

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
scaled_ebitda          U  | .01876   .08507    -48.6         | -13.08  0.000 |  3.09*
                       M  | .02691   .03478     -5.8    88.1 |  -0.99  0.320 |  1.47*
                          |                                  |               |
ln_atq                 U  | 6.4655   7.1287    -52.4         | -12.03  0.000 |  1.05
                       M  | 6.5188   6.5005      1.4    97.2 |   0.26  0.797 |  0.95
                          |                                  |               |
roa                    U  |-.02131   .00394    -52.4         | -13.78  0.000 |  2.61*
                       M  |-.01862  -.02017      3.2    93.9 |   0.49  0.624 |  0.93
                          |                                  |               |
leverage               U  | .75038   .62896     42.8         |  10.48  0.000 |  1.62*
                       M  | .74327   .73152      4.1    90.3 |   0.70  0.484 |  1.19*
                          |                                  |               |
ln_deal_amount         U  | 4.1115   5.2461    -66.5         | -17.29  0.000 |  2.42*
                       M  |  4.229   4.3599     -7.7    88.5 |  -1.39  0.163 |  1.73*
                          |                                  |               |
maturity_year          U  | 4.7621   4.5517      8.8         |   2.15  0.032 |  1.56*
                       M  | 4.7678   4.9048     -5.8    34.9 |  -0.95  0.344 |  1.05
                          |                                  |               |
interest_spread1       U  | 7.1193   4.4339     93.1         |  23.78  0.000 |  2.16*
                       M  | 6.9864   7.1843     -6.9    92.6 |  -1.00  0.316 |  0.78*
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.86; 1.16] for U and [0.86; 1.17] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.243    775.49    0.000     52.1      52.4     125.9*   2.49*    86
 Matched   | 0.004      7.88    0.343      5.0       5.8      15.7    1.21     57
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. graph export "$figdir/Figure5_psm_all.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure5_psm_all.pdf saved as PDF format

. 
. foreach var of varlist `info_vars' {
  2.         eststo: psmatch2 lender_is_private_credit `borr_vars' i.ff_12 `deal_vars', out(`var') logit n(1) ai(3) common caliper(0.01)
  3. }

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      monthly_fs  Unmatched | .531690141    .24283882   .288851321   .027467293    10.52
                        ATT | .524904215   .325670498   .199233716   .056136044     3.55
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est1 stored)

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    projected_fs  Unmatched | .661971831   .587430526   .074541305   .030818128     2.42
                        ATT | .647509579   .601532567   .045977011   .062235971     0.74
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est2 stored)

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  lender_meeting  Unmatched | .345070423   .171013254   .174057169   .024418392     7.13
                        ATT | .352490421   .245210728   .107279693   .054333794     1.97
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est3 stored)

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       hard_info  Unmatched | .781690141   .654553228   .127136913   .029492297     4.31
                        ATT | .766283525   .681992337   .084291188   .058729313     1.44
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est4 stored)

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
          info_n  Unmatched | 1.53873239    1.0012826   .537449795    .05312835    10.12
                        ATT | 1.52490421   1.17241379   .352490421   .124533353     2.83
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est5 stored)

Logistic regression                                     Number of obs =  2,623
                                                        LR chi2(18)   = 675.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -561.59544                             Pseudo R2     = 0.3756

-------------------------------------------------------------------------------------------------------------
                   lender_is_private_credit | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |    -2.4464   .6241737    -3.92   0.000    -3.669758   -1.223042
                                     ln_atq |   .0214055   .0765253     0.28   0.780    -.1285814    .1713925
                                        roa |   -5.66423   1.750514    -3.24   0.001    -9.095175   -2.233286
                                   leverage |   1.164371   .3007505     3.87   0.000     .5749108    1.753831
                                            |
                                      ff_12 |
                         Consumer Durables  |  -.1895724   .6004826    -0.32   0.752    -1.366497    .9873519
                             Manufacturing  |  -.8492741    .410579    -2.07   0.039    -1.653994   -.0445541
Oil, Gas, and Coal Extraction and Products  |  -.4723959   .4093906    -1.15   0.249    -1.274787    .3299949
             Chemicals and Allied Products  |  -.6976715   .6529291    -1.07   0.285    -1.977389    .5820461
                        Business Equipment  |  -.3174091   .3719244    -0.85   0.393    -1.046367    .4115492
     Telephone and Television Transmission  |  -.8012282   .7029401    -1.14   0.254    -2.178965    .5765091
                                 Utilities  |   .3183271   .5856789     0.54   0.587    -.8295825    1.466237
      Wholesale, Retail, and Some Services  |  -.2417204   .3985153    -0.61   0.544    -1.022796    .5393552
  Healthcare, Medical Equipment, and Drugs  |   .4106797    .387013     1.06   0.289    -.3478518    1.169211
                                   Finance  |  -.5908491   .3853791    -1.53   0.125    -1.346178    .1644799
                                     Other  |  -.3228901   .3508618    -0.92   0.357    -1.010567    .3647864
                                            |
                             ln_deal_amount |  -.6085725   .0563155   -10.81   0.000    -.7189489   -.4981961
                              maturity_year |   .0760466   .0364723     2.09   0.037     .0045622    .1475311
                           interest_spread1 |    .376134   .0268003    14.03   0.000     .3236063    .4286616
                                      _cons |  -2.476822   .5806845    -4.27   0.000    -3.614943   -1.338702
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
        all_info  Unmatched | .204225352   .038050449   .166174903   .014089548    11.79
                        ATT | .206896552     .0651341   .141762452   .032749657     4.33
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        23        261 |       284 
-----------+----------------------+----------
     Total |        23      2,600 |     2,623 
(est6 stored)

. estadd scalar r(att)

added scalar:
                e(att) =  .14176245

. estadd scalar r(seatt)

added scalar:
              e(seatt) =  .03274966

. esttab using "$tabdir/Table5_main_psm_pc.tex", replace obslast nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses star(* 0.10 ** 0.05 *** 0.01) plai
> n lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table5_main_psm_pc.tex)

. eststo clear

. 
. pstest `borr_vars' `deal_vars', graph both graphregion(color(white)) bgcolor(white)

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
scaled_ebitda          U  |-.00245   .08507    -61.4         | -12.96  0.000 |  3.46*
                       M  | .00449   .01603     -8.1    86.8 |  -0.90  0.371 |  1.72*
                          |                                  |               |
ln_atq                 U  | 6.2124   7.1287    -72.0         | -11.62  0.000 |  1.07
                       M  | 6.2738   6.2095      5.0    93.0 |   0.58  0.561 |  1.14
                          |                                  |               |
roa                    U  |-.03181   .00394    -70.7         | -14.40  0.000 |  2.97*
                       M  |-.02815  -.03177      7.2    89.9 |   0.70  0.485 |  0.98
                          |                                  |               |
leverage               U  | .77157   .62896     51.5         |   8.93  0.000 |  1.49*
                       M  | .75236   .74018      4.4    91.5 |   0.48  0.635 |  0.90
                          |                                  |               |
ln_deal_amount         U  | 3.5478   5.2461    -82.3         | -18.01  0.000 |  4.00*
                       M  | 3.7878   4.1115    -15.7    80.9 |  -1.87  0.062 |  2.47*
                          |                                  |               |
maturity_year          U  | 4.4326   4.5517     -5.7         |  -0.90  0.367 |  0.98
                       M  | 4.4661   4.8694    -19.3  -238.5 |  -1.96  0.051 |  0.70*
                          |                                  |               |
interest_spread1       U  | 7.8363   4.4339    117.8         |  22.23  0.000 |  2.17*
                       M  | 7.6632   8.2741    -21.1    82.0 |  -2.00  0.046 |  0.84
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.26] for U and [0.78; 1.28] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.363    653.59    0.000     65.9      70.7     172.9*   2.29*    71
 Matched   | 0.021     15.41    0.031     11.5       8.1      34.3*   1.27     43
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. graph export "$figdir/Figure5_psm_pc.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure5_psm_pc.pdf saved as PDF format

. 
. foreach var of varlist `info_vars' {
  2.         eststo: psmatch2 lender_is_other_nonbank `borr_vars' i.ff_12 `deal_vars', out(`var') logit n(1) ai(3) common caliper(0.01)
  3. }

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      monthly_fs  Unmatched | .356770833    .24283882   .113932013   .024028315     4.74
                        ATT | .362359551   .241573034   .120786517   .036765843     3.29
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est1 stored)

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    projected_fs  Unmatched | .533854167   .587430526  -.053576359   .027167454    -1.97
                        ATT | .539325843   .561797753   -.02247191   .042608141    -0.53
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est2 stored)

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  lender_meeting  Unmatched |    .234375   .171013254   .063361746   .021124216     3.00
                        ATT | .238764045   .216292135    .02247191   .034747638     0.65
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est3 stored)

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       hard_info  Unmatched |   .6171875   .654553228  -.037365728   .026274622    -1.42
                        ATT | .620786517   .612359551   .008426966   .041193847     0.20
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est4 stored)

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
          info_n  Unmatched |      1.125    1.0012826   .123717401   .046790715     2.64
                        ATT | 1.14044944   1.01966292   .120786517    .07868094     1.54
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est5 stored)

Logistic regression                                     Number of obs =  2,723
                                                        LR chi2(18)   = 384.01
                                                        Prob > chi2   = 0.0000
Log likelihood = -915.74599                             Pseudo R2     = 0.1733

-------------------------------------------------------------------------------------------------------------
                    lender_is_other_nonbank | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------------------------+----------------------------------------------------------------
                              scaled_ebitda |  -1.687262   .5421646    -3.11   0.002    -2.749886   -.6246394
                                     ln_atq |   .0079733   .0662384     0.12   0.904    -.1218517    .1377982
                                        roa |  -2.714715   1.538909    -1.76   0.078     -5.73092    .3014905
                                   leverage |    .816105   .2302072     3.55   0.000     .3649073    1.267303
                                            |
                                      ff_12 |
                         Consumer Durables  |   .1981801   .6247485     0.32   0.751    -1.026304    1.422665
                             Manufacturing  |   .1100536   .4199518     0.26   0.793    -.7130369     .933144
Oil, Gas, and Coal Extraction and Products  |   .9766252   .4093079     2.39   0.017     .1743964    1.778854
             Chemicals and Allied Products  |    .953535   .4890378     1.95   0.051    -.0049615    1.912032
                        Business Equipment  |   .1943383   .4104076     0.47   0.636    -.6100459    .9987224
     Telephone and Television Transmission  |   1.252624   .4722862     2.65   0.008     .3269596    2.178288
                                 Utilities  |   .9197759   .5522137     1.67   0.096     -.162543    2.002095
      Wholesale, Retail, and Some Services  |   .9992514   .3986818     2.51   0.012     .2178494    1.780653
  Healthcare, Medical Equipment, and Drugs  |   1.139189   .4092699     2.78   0.005     .3370344    1.941343
                                   Finance  |    1.17627   .3801769     3.09   0.002     .4311369    1.921403
                                     Other  |    .973446   .3739321     2.60   0.009     .2405526    1.706339
                                            |
                             ln_deal_amount |  -.4062752   .0592944    -6.85   0.000      -.52249   -.2900604
                              maturity_year |   .1235159    .024042     5.14   0.000     .0763944    .1706374
                           interest_spread1 |   .2314074   .0218383    10.60   0.000     .1886052    .2742097
                                      _cons |  -2.967741   .5192338    -5.72   0.000     -3.98542   -1.950061
-------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
        all_info  Unmatched | .091145833   .038050449   .053095384    .01143816     4.64
                        ATT | .092696629   .033707865   .058988764   .019574944     3.01
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,339 |     2,339 
   Treated |        28        356 |       384 
-----------+----------------------+----------
     Total |        28      2,695 |     2,723 
(est6 stored)

. estadd scalar r(att)

added scalar:
                e(att) =  .05898876

. estadd scalar r(seatt)

added scalar:
              e(seatt) =  .01957494

. esttab using "$tabdir/Table5_main_psm_other.tex", replace obslast nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses star(* 0.10 ** 0.05 *** 0.01) p
> lain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table5_main_psm_other.tex)

. eststo clear

. 
. pstest `borr_vars' `deal_vars', graph both graphregion(color(white)) bgcolor(white)

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
scaled_ebitda          U  | .03444   .08507    -38.7         |  -8.62  0.000 |  2.75*
                       M  | .05134   .05061      0.6    98.6 |   0.08  0.936 |  0.95
                          |                                  |               |
ln_atq                 U  | 6.6527   7.1287    -38.3         |  -6.93  0.000 |  0.98
                       M  | 6.7485   6.6811      5.4    85.9 |   0.71  0.479 |  0.80*
                          |                                  |               |
roa                    U  |-.01355   .00394    -38.3         |  -8.18  0.000 |  2.23*
                       M  | -.0086  -.00808     -1.1    97.0 |  -0.15  0.882 |  1.18
                          |                                  |               |
leverage               U  |  .7347   .62896     36.7         |   7.40  0.000 |  1.70*
                       M  | .70197   .71728     -5.3    85.5 |  -0.72  0.472 |  1.14
                          |                                  |               |
ln_deal_amount         U  | 4.5283   5.2461    -54.7         |  -9.98  0.000 |  1.02
                       M  |  4.619   4.5947      1.9    96.6 |   0.24  0.813 |  0.78*
                          |                                  |               |
maturity_year          U  | 5.0057   4.5517     17.8         |   3.68  0.000 |  1.96*
                       M  | 4.8965    4.958     -2.4    86.5 |  -0.30  0.763 |  1.10
                          |                                  |               |
interest_spread1       U  | 6.5889   4.4339     76.3         |  15.93  0.000 |  2.03*
                       M  | 6.2943   6.3464     -1.8    97.6 |  -0.22  0.825 |  0.89
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.82; 1.22] for U and [0.81; 1.23] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.153    339.74    0.000     43.0      38.3      99.4*   2.24*    71
 Matched   | 0.001      1.48    0.983      2.6       1.9       9.1    1.04     29
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. graph export "$figdir/Figure5_psm_other.pdf", replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Figures/Figure5_psm_other.pdf saved as PDF format

. 
. 
. /**************
>         Regression Discontinuity Design Around prev_ebitda == 0
>         ***************/
.         use "$cleandir/final_regression_sample.dta", clear

.         
. drop if asset_based == 1
(47 observations deleted)

. drop if debt_to_ebitda <= 4
(933 observations deleted)

. * check for binds around debt_to_ebitda_gr6
. egen debt_to_ebitda_bins = cut(debt_to_ebitda), at(2 4 6 8 10 15 20 25 30 35 40)
(152 missing values generated)

. preserve

.         collapse (mean) lender_is_nonbank (count) gvkey, by(debt_to_ebitda_bins)

.         scatter lender_is_nonbank debt_to_ebitda_bins

.         *scatter gvkey debt_to_ebitda_bins
. restore

. 
. rddensity debt_to_ebitda, c(6) plot
Computing data-driven bandwidth selectors.

Bandwidth hl greater than the range of the data.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option nomasspoints to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

     c =     6.000 | Left of c  Right of c          Number of obs =         2027
-------------------+----------------------          Model         = unrestricted
     Number of obs |       487        1540          BW method     =         comb
Eff. Number of obs |       487         428          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     2.081       2.149

Running variable: debt_to_ebitda.
------------------------------------------
            Method |      T          P>|T|
-------------------+----------------------
            Robust |   -0.7625      0.4457
------------------------------------------

P-values of binomial tests. (H0: prob = .5)
-----------------------------------------------------
 Window Length / 2 |       <c         >=c |     P>|T|
-------------------+----------------------+----------
             0.055 |        8          12 |    0.5034
             0.110 |       26          28 |    0.8919
             0.165 |       39          46 |    0.5154
             0.220 |       48          60 |    0.2898
             0.275 |       63          71 |    0.5455
             0.331 |       81          80 |    1.0000
             0.386 |      103          94 |    0.5688
             0.441 |      118         111 |    0.6918
             0.496 |      130         122 |    0.6593
             0.551 |      140         132 |    0.6713
-----------------------------------------------------

. rdrobust lender_is_nonbank debt_to_ebitda, c(6)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 6 | Left of c  Right of c            Number of obs =       2027
-------------------+----------------------            BW type       =      mserd
     Number of obs |       487        1540            Kernel        = Triangular
Eff. Number of obs |       331         296            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |     1.335       1.335
       BW bias (b) |     2.224       2.224
         rho (h/b) |     0.600       0.600
        Unique obs |       459        1279

Outcome: lender_is_nonbank. Running variable: debt_to_ebitda.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.15976     .06336   -2.5214  0.012   -.283944     -.035571
            Robust |     -          -     -2.9706  0.003   -.369636     -.075765
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. 
.         use "$cleandir/final_regression_sample.dta", clear

.         
.         drop if asset_based == 1
(47 observations deleted)

.         drop if prev_ebitda > 50
(1,752 observations deleted)

.         
. * check for share of nonbank loans for over prev_ebitda
. egen prev_ebitda_bins = cut(prev_ebitda), at(-50 -20 -10 -5 -1 5 10 20 50)
(145 missing values generated)

. preserve

.         collapse (mean) lender_is_nonbank (count) gvkey, by(prev_ebitda_bins)

.         scatter lender_is_nonbank prev_ebitda_bins

.         *scatter gvkey prev_ebitda_bins
. restore

. 
. histogram prev_ebitda, bin(50) normal kdensity freq
(bin=50, start=-266.806, width=6.33298)

. 
. rddensity prev_ebitda, c(0) plot
Computing data-driven bandwidth selectors.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option nomasspoints to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

     c =     0.000 | Left of c  Right of c          Number of obs =         1208
-------------------+----------------------          Model         = unrestricted
     Number of obs |       421         787          BW method     =         comb
Eff. Number of obs |       239         724          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |    31.457      44.560

Running variable: prev_ebitda.
------------------------------------------
            Method |      T          P>|T|
-------------------+----------------------
            Robust |    0.7653      0.4441
------------------------------------------

P-values of binomial tests. (H0: prob = .5)
-----------------------------------------------------
 Window Length / 2 |       <c         >=c |     P>|T|
-------------------+----------------------+----------
             0.394 |       10          10 |    1.0000
             0.788 |       19          15 |    0.6076
             1.182 |       25          20 |    0.5515
             1.576 |       36          26 |    0.2529
             1.970 |       45          33 |    0.2127
             2.364 |       50          38 |    0.2408
             2.758 |       55          44 |    0.3149
             3.152 |       58          50 |    0.5008
             3.546 |       61          63 |    0.9285
             3.940 |       65          68 |    0.8624
-----------------------------------------------------

. 
. rdrobust lender_is_nonbank prev_ebitda, c(0)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1208
-------------------+----------------------            BW type       =      mserd
     Number of obs |       421         787            Kernel        = Triangular
Eff. Number of obs |       153         287            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    15.584      15.584
       BW bias (b) |    23.141      23.141
         rho (h/b) |     0.673       0.673
        Unique obs |       331         681

Outcome: lender_is_nonbank. Running variable: prev_ebitda.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02899     .09219   -0.3145  0.753   -.209675      .151687
            Robust |     -          -     -0.2059  0.837   -.239034      .193591
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. rdrobust monthly_fs prev_ebitda, c(0) fuzzy(lender_is_nonbank)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1208
-------------------+----------------------            BW type       =      mserd
     Number of obs |       421         787            Kernel        = Triangular
Eff. Number of obs |       228         492            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    28.173      28.173
       BW bias (b) |    44.281      44.281
         rho (h/b) |     0.636       0.636
        Unique obs |       331         681

First-stage estimates. Outcome: lender_is_nonbank. Running variable: prev_ebitda.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04139     .07046   -0.5875  0.557   -.179498      .096708
            Robust |     -          -     -0.4302  0.667   -.197689       .12652
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: monthly_fs. Running variable: prev_ebitda. Treatment Status: lender_is_nonbank.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1625     2.4968   0.4656   0.642    -3.7311      6.05602
            Robust |     -          -     0.3030   0.762   -4.89284      6.68226
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. 
. /**************
>         DiD
>         ***************/
.         
. *** in 2018 from SNC increase from $20 to $100 million  
. use "$cleandir/final_regression_sample.dta", clear

. drop if asset_based == 1
(47 observations deleted)

. 
. *** generate treat and post variables 
. 
. gen post = 1 if year > 2013
(982 missing values generated)

. replace post = 0 if post == .
(982 real changes made)

. 
. gen treat_post = debt_to_ebitda_gr6 * post

. 
. *TWFE
. reghdfe lender_is_private_credit debt_to_ebitda_gr6 post treat_post deal_amount1 maturity_year interest_spread1 ln_atq leverage, absorb(year ff_12)
(MWFE estimator converged in 5 iterations)
note: post is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)

HDFE Linear regression                            Number of obs   =      2,581
Absorbing 2 HDFE groups                           F(   7,   2549) =      92.49
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2436
                                                  Adj R-squared   =     0.2344
                                                  Within R-sq.    =     0.2026
                                                  Root MSE        =     0.2722

------------------------------------------------------------------------------------
lender_is_privat~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
debt_to_ebitda_gr6 |   .0009083   .0194244     0.05   0.963    -.0371809    .0389975
              post |          0  (omitted)
        treat_post |   .0586874   .0236022     2.49   0.013      .012406    .1049688
      deal_amount1 |  -.0000613   .0000146    -4.20   0.000    -.0000899   -.0000326
     maturity_year |  -.0001296   .0026667    -0.05   0.961    -.0053587    .0050994
  interest_spread1 |   .0403976   .0022323    18.10   0.000     .0360203     .044775
            ln_atq |  -.0333375   .0054005    -6.17   0.000    -.0439273   -.0227476
          leverage |    .104668   .0228884     4.57   0.000     .0597862    .1495498
             _cons |   .0765307   .0407708     1.88   0.061    -.0034164    .1564779
------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+

. */
. reghdfe monthly_fs debt_to_ebitda_gr6 post treat_post deal_amount1 maturity_year interest_spread1 ln_atq leverage, absorb(gvkey ff_12)
(dropped 859 singleton observations)
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =      2,101
Absorbing 2 HDFE groups                           F(   8,   1336) =       4.60
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.6964
                                                  Adj R-squared   =     0.5228
                                                  Within R-sq.    =     0.0268
                                                  Root MSE        =     0.3147

------------------------------------------------------------------------------------
        monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
debt_to_ebitda_gr6 |   .0487283    .040808     1.19   0.233    -.0313265     .128783
              post |   .0124697   .0378924     0.33   0.742    -.0618653    .0868047
        treat_post |    .033304   .0453503     0.73   0.463    -.0556616    .1222696
      deal_amount1 |  -.0000144   .0000313    -0.46   0.645    -.0000759     .000047
     maturity_year |  -.0151699   .0044171    -3.43   0.001    -.0238351   -.0065046
  interest_spread1 |   .0030381   .0035968     0.84   0.398    -.0040179    .0100942
            ln_atq |  -.0700017   .0225495    -3.10   0.002     -.114238   -.0257654
          leverage |   .0656162   .0629771     1.04   0.298    -.0579285    .1891609
             _cons |   .7429316    .157844     4.71   0.000     .4332825    1.052581
------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       gvkey |       757           0         757     |
       ff_12 |        12          12           0     |
-----------------------------------------------------+

. 
. *** in 2013 SNC guideline says that firms with <0 ebitda is substandard -> after 2013 firms
. *       with < 0 ebitda is less likely to borrow from banks and more likely to borrow from PCs
. *       Treat: < EBITDA, Post: 2014 onward
. use "$cleandir/final_regression_sample.dta", clear

. 
. *** generate treat and post variables 
. 
. gen treat = 1 if prev_ebitda < 0
(2,584 missing values generated)

. replace treat = 0 if treat == .
(2,584 real changes made)

. 
. gen post = 1 if year >= 2014
(986 missing values generated)

. replace post = 0 if post == .
(986 real changes made)

. 
. gen treat_post = treat * post

. 
. * Year-Indutry FE with Treat and Treat_Post
. reghdfe lender_is_nonbank treat post treat_post maturity_year interest_spread1, absorb(year ff_12)
(MWFE estimator converged in 5 iterations)
note: post is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   4,   2978) =     166.44
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2212
                                                  Adj R-squared   =     0.2138
                                                  Within R-sq.    =     0.1827
                                                  Root MSE        =     0.3686

----------------------------------------------------------------------------------
lender_is_nonb~k | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
           treat |   .0868263   .0390089     2.23   0.026     .0103392    .1633135
            post |          0  (omitted)
      treat_post |   .1639667   .0451407     3.63   0.000     .0754565    .2524769
   maturity_year |   .0077854   .0030749     2.53   0.011     .0017563    .0138145
interest_spread1 |   .0548324   .0025572    21.44   0.000     .0498183    .0598465
           _cons |  -.1192542    .019895    -5.99   0.000    -.1582635   -.0802448
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+

. reghdfe monthly_fs treat post treat_post maturity_year interest_spread1, absorb(year ff_12)
(MWFE estimator converged in 5 iterations)
note: post is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   4,   2978) =      29.96
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0793
                                                  Adj R-squared   =     0.0707
                                                  Within R-sq.    =     0.0387
                                                  Root MSE        =     0.4351

----------------------------------------------------------------------------------
      monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
           treat |   .2336484    .046041     5.07   0.000     .1433731    .3239238
            post |          0  (omitted)
      treat_post |  -.1443449   .0532782    -2.71   0.007    -.2488107   -.0398791
   maturity_year |  -.0269838   .0036292    -7.44   0.000    -.0340997   -.0198678
interest_spread1 |   .0125496   .0030182     4.16   0.000     .0066316    .0184676
           _cons |    .328212   .0234814    13.98   0.000     .2821705    .3742535
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+

. 
. * Year-Indutry FE with Treat and Treat_Post
. la var treat_post "Treat*Post"

. local borr_vars "scaled_ebitda ln_atq roa leverage"

. local deal_vars "ln_deal_amount maturity_year interest_spread1" 

. local info_vars "monthly_fs projected_fs lender_meeting hard_info info_n all_info"

. eststo: reghdfe lender_is_private_credit treat_post `deal_vars', absorb(year gvkey)
(dropped 841 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      1,782
Absorbing 2 HDFE groups                           F(   4,   1109) =      61.00
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.6488
                                                  Adj R-squared   =     0.4361
                                                  Within R-sq.    =     0.1803
                                                  Root MSE        =     0.2313

----------------------------------------------------------------------------------
lender_is_priv~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |   .1418439   .0390794     3.63   0.000      .065166    .2185218
  ln_deal_amount |  -.0467541   .0064756    -7.22   0.000    -.0594598   -.0340484
   maturity_year |   .0096018   .0039873     2.41   0.016     .0017783    .0174254
interest_spread1 |   .0400269   .0031197    12.83   0.000     .0339056    .0461482
           _cons |   .0937148   .0374953     2.50   0.013     .0201451    .1672844
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       656           1         655     |
-----------------------------------------------------+
(est1 stored)

. foreach var of varlist `info_vars' {
  2.         eststo: reghdfe `var' treat_post `deal_vars', absorb(year gvkey)
  3. }
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       4.76
                                                  Prob > F        =     0.0008
                                                  R-squared       =     0.6979
                                                  Adj R-squared   =     0.5234
                                                  Within R-sq.    =     0.0138
                                                  Root MSE        =     0.3165

----------------------------------------------------------------------------------
      monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |    .106158   .0426615     2.49   0.013     .0224685    .1898474
  ln_deal_amount |   -.000523   .0078075    -0.07   0.947     -.015839     .014793
   maturity_year |  -.0156895   .0045008    -3.49   0.001    -.0245187   -.0068602
interest_spread1 |   .0026461   .0036719     0.72   0.471     -.004557    .0098493
           _cons |   .3500131   .0456236     7.67   0.000     .2605128    .4395133
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est2 stored)
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       5.08
                                                  Prob > F        =     0.0005
                                                  R-squared       =     0.6924
                                                  Adj R-squared   =     0.5148
                                                  Within R-sq.    =     0.0147
                                                  Root MSE        =     0.3424

----------------------------------------------------------------------------------
    projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |  -.0049369   .0461521    -0.11   0.915    -.0954739    .0856001
  ln_deal_amount |   .0269669   .0084463     3.19   0.001     .0103978    .0435361
   maturity_year |   -.016665   .0048691    -3.42   0.001    -.0262167   -.0071134
interest_spread1 |   -.004023   .0039723    -1.01   0.311    -.0118155    .0037695
           _cons |   .5547873   .0493566    11.24   0.000     .4579641    .6516106
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est3 stored)
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       4.81
                                                  Prob > F        =     0.0007
                                                  R-squared       =     0.6963
                                                  Adj R-squared   =     0.5210
                                                  Within R-sq.    =     0.0139
                                                  Root MSE        =     0.2813

----------------------------------------------------------------------------------
  lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |   .0470524   .0379103     1.24   0.215    -.0273165    .1214212
  ln_deal_amount |   .0240206   .0069379     3.46   0.001     .0104103    .0376308
   maturity_year |   .0026995   .0039995     0.67   0.500    -.0051465    .0105454
interest_spread1 |   .0067302   .0032629     2.06   0.039     .0003292    .0131311
           _cons |   .0361141   .0405425     0.89   0.373    -.0434185    .1156466
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est4 stored)
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       5.02
                                                  Prob > F        =     0.0005
                                                  R-squared       =     0.6778
                                                  Adj R-squared   =     0.4917
                                                  Within R-sq.    =     0.0145
                                                  Root MSE        =     0.3351

----------------------------------------------------------------------------------
       hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |   .0225654   .0451661     0.50   0.617    -.0660372    .1111681
  ln_deal_amount |    .026831   .0082658     3.25   0.001     .0106159    .0430462
   maturity_year |  -.0167669    .004765    -3.52   0.000    -.0261145   -.0074193
interest_spread1 |  -.0018628   .0038874    -0.48   0.632    -.0094888    .0057633
           _cons |   .6205616   .0483021    12.85   0.000      .525807    .7153162
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est5 stored)
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       5.42
                                                  Prob > F        =     0.0003
                                                  R-squared       =     0.6949
                                                  Adj R-squared   =     0.5187
                                                  Within R-sq.    =     0.0157
                                                  Root MSE        =     0.6168

----------------------------------------------------------------------------------
          info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |   .1482734   .0831339     1.78   0.075    -.0148111     .311358
  ln_deal_amount |   .0504645   .0152143     3.32   0.001     .0206184    .0803106
   maturity_year |  -.0296551   .0087707    -3.38   0.001    -.0468605   -.0124496
interest_spread1 |   .0053533   .0071553     0.75   0.454    -.0086834      .01939
           _cons |   .9409144   .0889062    10.58   0.000     .7665065    1.115322
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est6 stored)
(dropped 859 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      2,148
Absorbing 2 HDFE groups                           F(   4,   1361) =       1.11
                                                  Prob > F        =     0.3489
                                                  R-squared       =     0.6234
                                                  Adj R-squared   =     0.4058
                                                  Within R-sq.    =     0.0033
                                                  Root MSE        =     0.1916

----------------------------------------------------------------------------------
        all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
      treat_post |   .0494716   .0258212     1.92   0.056    -.0011821    .1001254
  ln_deal_amount |   .0020509   .0047255     0.43   0.664    -.0072192     .011321
   maturity_year |  -.0006164   .0027242    -0.23   0.821    -.0059604    .0047276
interest_spread1 |   .0018014   .0022224     0.81   0.418    -.0025584    .0061612
           _cons |   .0440998   .0276141     1.60   0.110     -.010071    .0982706
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       gvkey |       770           1         769     |
-----------------------------------------------------+
(est7 stored)

. esttab using "$tabdir/Table6_main_did.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table6_main_did.tex)

. * clear storeed est
. eststo clear

. 
. * fuzzy DID
. *sort treat year
. *by treat year: egen mean_D = mean(lender_is_private_credit)
. *by treat: g lag_mean_D = mean_D[_n-1] if treat == treat[_n-1] & year-1==year[_n-1]
. *g G_T = sign(mean_D - lag_mean_D)
. *g G_Tplus1 = G_T[_n+1] if treat==treat[_n+1] & year+1 == year[_n+1]
. *replace G_T = 0 if G_T == .
. *replace G_Tplus1 = 0 if G_Tplus1 == .
. *fuzzydid monthly_fs treat year lender_is_private_credit, did
. 
. 
. /**************
>         Cross-Sectional Tests
>         ***************/
.         
. local borr_vars "scaled_ebitda ln_atq roa leverage"

. local deal_vars "ln_deal_amount maturity_year interest_spread1" 

. local y_vars "lender_is_nonbank lender_is_private_credit" 

. local info_vars "monthly_fs projected_fs lender_meeting hard_info info_n all_info"

. 
. *** Large Versus Small Direct Lenders Lenders
.         use "$cleandir/final_regression_sample.dta", replace

.         
. * generate large and small Direct Lenders lenders       
. bysort lead_arranger: gen deal_count = _N

. tab deal_count if lender_is_nonbank == 1        

 deal_count |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        199       29.79       29.79
          2 |        104       15.57       45.36
          3 |         72       10.78       56.14
          4 |         36        5.39       61.53
          5 |         45        6.74       68.26
          6 |         12        1.80       70.06
          7 |         21        3.14       73.20
          8 |          8        1.20       74.40
          9 |         18        2.69       77.10
         10 |         30        4.49       81.59
         11 |         11        1.65       83.23
         12 |         12        1.80       85.03
         14 |         14        2.10       87.13
         21 |         21        3.14       90.27
         29 |         29        4.34       94.61
         36 |         36        5.39      100.00
------------+-----------------------------------
      Total |        668      100.00

. gen big_nonbank = 1 if lender_is_nonbank == 1 & deal_count >= 5
(2,750 missing values generated)

. replace big_nonbank = 0 if big_nonbank ==. & lender_is_nonbank == 1
(411 real changes made)

. 
. * generate big_bank == 1 if it's ont of the g-sibs
. * get rid of . 
. replace lead_arranger = subinstr(lead_arranger, ".", "", .)
(375 real changes made)

. 
. gen big_bank = 1 if strpos(lead_arranger, "bank of america") > 0
(2,720 missing values generated)

. replace big_bank = 1 if strpos(lead_arranger, "bank of america") > 0
(0 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "bofa securities") > 0
(52 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "citibank") > 0
(58 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "citigroup") > 0
(41 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "citicorp") > 0
(3 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "credit suisse") > 0
(85 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "deutsche") > 0
(73 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "jp morgan") > 0
(111 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "jpmorgan") > 0
(335 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "merrill lynch") > 0
(119 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "morgan stanley") > 0
(51 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "wells fargo") > 0
(299 real changes made)

. replace big_bank = 1 if strpos(lead_arranger, "goldman sachs") > 0
(50 real changes made)

. replace big_bank = 0 if big_bank == . & lender_is_nonbank == 0
(776 real changes made)

. 
. la var big_bank "Big Bank"

. la var big_nonbank "Big Nonbank"

. gen big_nonbank_inter = big_nonbank * lender_is_nonbank
(2,339 missing values generated)

. replace big_nonbank_inter = 0 if big_nonbank_inter == .
(2,339 real changes made)

. la var big_nonbank_inter "Lender is Nonbank * Big"

. 
. *** Nov 12 Update: Regression with bank and nonbank + nonbank*big_nonbank
.         foreach var of varlist `info_vars' {
  2.                 eststo: reghdfe `var' lender_is_nonbank big_nonbank_inter `borr_vars' `deal_vars', absorb(year ff_12)
  3.         }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      32.93
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1291
                                                  Adj R-squared   =     0.1194
                                                  Within R-sq.    =     0.0906
                                                  Root MSE        =     0.4235

-----------------------------------------------------------------------------------
       monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .1002495   .0261505     3.83   0.000     .0489745    .1515245
big_nonbank_inter |   .0548454   .0341833     1.60   0.109    -.0121798    .1218707
    scaled_ebitda |  -.1348167   .0739137    -1.82   0.068    -.2797439    .0101105
           ln_atq |  -.0677261   .0081839    -8.28   0.000    -.0837728   -.0516793
              roa |  -.4756766   .2069161    -2.30   0.022    -.8813898   -.0699634
         leverage |   .0508755   .0311897     1.63   0.103      -.01028     .112031
   ln_deal_amount |  -.0028378   .0065935    -0.43   0.667    -.0157661    .0100906
    maturity_year |  -.0235664   .0036216    -6.51   0.000    -.0306675   -.0164654
 interest_spread1 |  -.0013539   .0032978    -0.41   0.681      -.00782    .0051122
            _cons |   .8351997   .0535301    15.60   0.000     .7302398    .9401596
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      14.15
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1009
                                                  Adj R-squared   =     0.0909
                                                  Within R-sq.    =     0.0411
                                                  Root MSE        =     0.4694

-----------------------------------------------------------------------------------
     projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0523819    .028985    -1.81   0.071    -.1092146    .0044508
big_nonbank_inter |   .0350319   .0378884     0.92   0.355    -.0392582    .1093221
    scaled_ebitda |  -.0288725   .0819252    -0.35   0.725    -.1895083    .1317634
           ln_atq |  -.0954811    .009071   -10.53   0.000    -.1132672   -.0776951
              roa |  -.0120646   .2293437    -0.05   0.958     -.461753    .4376239
         leverage |  -.0127159   .0345703    -0.37   0.713    -.0805001    .0550682
   ln_deal_amount |   .0273357   .0073082     3.74   0.000     .0130061    .0416653
    maturity_year |  -.0016632   .0040141    -0.41   0.679     -.009534    .0062075
 interest_spread1 |   .0045988   .0036552     1.26   0.208    -.0025682    .0117658
            _cons |   1.121208   .0593323    18.90   0.000     1.004872    1.237545
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      25.74
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1192
                                                  Adj R-squared   =     0.1095
                                                  Within R-sq.    =     0.0723
                                                  Root MSE        =     0.3743

-----------------------------------------------------------------------------------
   lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0282759   .0231139    -1.22   0.221    -.0735967     .017045
big_nonbank_inter |   .1726884   .0302138     5.72   0.000     .1134463    .2319305
    scaled_ebitda |  -.0590027   .0653307    -0.90   0.367    -.1871006    .0690953
           ln_atq |  -.0222879   .0072336    -3.08   0.002    -.0364713   -.0081045
              roa |  -.1706351   .1828885    -0.93   0.351    -.5292359    .1879658
         leverage |   .1712904   .0275678     6.21   0.000     .1172364    .2253444
   ln_deal_amount |   .0299135   .0058279     5.13   0.000     .0184865    .0413406
    maturity_year |   .0052099    .003201     1.63   0.104    -.0010666    .0114863
 interest_spread1 |   .0199078   .0029148     6.83   0.000     .0141925     .025623
            _cons |  -.0393151   .0473141    -0.83   0.406    -.1320868    .0534566
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      19.10
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0958
                                                  Adj R-squared   =     0.0858
                                                  Within R-sq.    =     0.0547
                                                  Root MSE        =     0.4524

-----------------------------------------------------------------------------------
        hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0458586   .0279354    -1.64   0.101    -.1006333     .008916
big_nonbank_inter |   .0564558   .0365164     1.55   0.122    -.0151441    .1280557
    scaled_ebitda |  -.0526169   .0789585    -0.67   0.505    -.2074357     .102202
           ln_atq |  -.1010502   .0087425   -11.56   0.000    -.1181922   -.0839082
              roa |  -.1406537   .2210386    -0.64   0.525    -.5740578    .2927504
         leverage |   .0264291   .0333184     0.79   0.428    -.0389004    .0917586
   ln_deal_amount |   .0269912   .0070435     3.83   0.000     .0131805    .0408019
    maturity_year |  -.0099772   .0038688    -2.58   0.010    -.0175629   -.0023915
 interest_spread1 |   .0044518   .0035228     1.26   0.206    -.0024556    .0113592
            _cons |   1.247438   .0571837    21.81   0.000     1.135314    1.359562
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      32.38
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1414
                                                  Adj R-squared   =     0.1319
                                                  Within R-sq.    =     0.0893
                                                  Root MSE        =     0.8196

-----------------------------------------------------------------------------------
           info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0195918   .0506073     0.39   0.699    -.0796372    .1188207
big_nonbank_inter |   .2625658   .0661525     3.97   0.000     .1328564    .3922751
    scaled_ebitda |  -.2226918   .1430401    -1.56   0.120    -.5031594    .0577758
           ln_atq |  -.1854951   .0158378   -11.71   0.000    -.2165493   -.1544409
              roa |  -.6583762   .4004303    -1.64   0.100    -1.443525    .1267724
         leverage |     .20945   .0603592     3.47   0.001        .0911       .3278
   ln_deal_amount |   .0544115     .01276     4.26   0.000     .0293922    .0794307
    maturity_year |  -.0200198   .0070086    -2.86   0.004     -.033762   -.0062776
 interest_spread1 |   .0231526   .0063819     3.63   0.000     .0106392     .035666
            _cons |   1.917093   .1035932    18.51   0.000     1.713971    2.120214
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      17.50
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0744
                                                  Adj R-squared   =     0.0641
                                                  Within R-sq.    =     0.0503
                                                  Root MSE        =     0.2307

-----------------------------------------------------------------------------------
         all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0513058   .0142459     3.60   0.000      .023373    .0792385
big_nonbank_inter |   .0857646   .0186218     4.61   0.000     .0492517    .1222775
    scaled_ebitda |  -.0025895   .0402655    -0.06   0.949    -.0815406    .0763615
           ln_atq |  -.0168562   .0044583    -3.78   0.000    -.0255979   -.0081145
              roa |   .0523284   .1127203     0.46   0.643    -.1686894    .2733461
         leverage |   .0328565    .016991     1.93   0.053    -.0004588    .0661718
   ln_deal_amount |   .0075734   .0035919     2.11   0.035     .0005305    .0146162
    maturity_year |   -.005349   .0019729    -2.71   0.007    -.0092174   -.0014806
 interest_spread1 |   .0056575   .0017965     3.15   0.002      .002135      .00918
            _cons |   .0965103   .0291613     3.31   0.001      .039332    .1536886
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est6 stored)

.         esttab using "$tabdir/Table7.tex", replace ///
>         nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
>         star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table7.tex)

.         * clear storeed est
.         eststo clear

. 
. preserve 

.         keep if lender_is_nonbank == 0
(668 observations deleted)

.         tab lead_arranger lender_meeting

                      |    Lender Meeting
        lead_arranger |         0          1 |     Total
----------------------+----------------------+----------
     abn amro bank nv |         3          0 |         3 
    absa bank limited |         1          0 |         1 
            ally bank |         0          2 |         2 
        alpha bank ae |         2          0 |         2 
amegy bank national.. |         1          0 |         1 
      associated bank |         1          0 |         1 
     bangkok bank pcl |         1          0 |         1 
     bank hapoalim bm |         2          0 |         2 
       bank leumi usa |         1          0 |         1 
      bank of america |       228         20 |       248 
bank of america lea.. |         2          0 |         2 
bank of america mer.. |        17          0 |        17 
bank of america mer.. |         1          0 |         1 
bank of america sec.. |        18          0 |        18 
bank of america sec.. |         1          0 |         1 
        bank of china |         1          0 |         1 
     bank of montreal |        15          1 |        16 
     bank of the west |         2          0 |         2 
banka monte dei pas.. |         1          0 |         1 
bankers trust company |         2          0 |         2 
banko de crdito d.. |         1          0 |         1 
      banko santander |         1          0 |         1 
           bankunited |         2          0 |         2 
    barclays bank plc |        25         21 |        46 
barclays bank plc a.. |         0          2 |         2 
     barclays capital |         6          1 |         7 
 barclays capital inc |         0          1 |         1 
         bbva compass |         1          0 |         1 
  bbva securities inc |         2          0 |         2 
             bbva usa |         0          1 |         1 
  bmo capital markets |        14          0 |        14 
bmo capital markets.. |        17          2 |        19 
bmo capital markets.. |         1          0 |         1 
bmo capital markets.. |         1          0 |         1 
      bmo harris bank |         1          0 |         1 
   bmo harris bank na |        13          0 |        13 
bmo private equity .. |         1          0 |         1 
          bnp paribas |         9          1 |        10 
bnp paribas and soc.. |         1          0 |         1 
bnp paribas securit.. |         4          0 |         4 
      bofa securities |        50          2 |        52 
branch banking and .. |         1          0 |         1 
         cadence bank |         2          0 |         2 
canadian imperial b.. |         0          2 |         2 
          capital one |         9          2 |        11 
capital one busines.. |         1          0 |         1 
capital one leverag.. |         1          0 |         1 
china merchants ban.. |         2          0 |         2 
        cibc bank usa |         1          2 |         3 
cibc world markets .. |         0          1 |         1 
             citibank |        49          7 |        56 
  citibank europe plc |         1          0 |         1 
          citibank na |         1          0 |         1 
citicorp internatio.. |         0          1 |         1 
citicorp north amer.. |         1          0 |         1 
         citicorp usa |         1          0 |         1 
citigroup global ma.. |        23         11 |        34 
citigroup global ma.. |         1          0 |         1 
citigroup global ma.. |         1          0 |         1 
citigroup global ma.. |         1          0 |         1 
citigroup global ma.. |         1          0 |         1 
citigroup global ma.. |         1          0 |         1 
citigroup global ma.. |         1          0 |         1 
        citizens bank |        15          0 |        15 
citizens bank of pe.. |         2          0 |         2 
citizens capital ma.. |         1          0 |         1 
   city national bank |         2          0 |         2 
               cobank |        16          0 |        16 
        comenity bank |         1          0 |         1 
        comerica bank |         0         11 |        11 
comerica bank and b.. |         0          1 |         1 
commerzbank aktieng.. |         2          0 |         2 
community banks of .. |         1          0 |         1 
         compass bank |         3          0 |         3 
cooperatieve centra.. |         1          0 |         1 
coperatieve centr.. |         1          0 |         1 
coperatieve centr.. |         2          0 |         2 
credit agricole cor.. |         3          0 |         3 
        credit suisse |         3          0 |         3 
     credit suisse ag |        19          6 |        25 
credit suisse first.. |         2          0 |         2 
credit suisse loan .. |         1          4 |         5 
credit suisse secur.. |        29         18 |        47 
crdit agricole co.. |         6          0 |         6 
         dbs bank ltd |         1          0 |         1 
     deutsche bank ag |        11          0 |        11 
deutsche bank ag ca.. |         1          0 |         1 
deutsche bank ag de.. |         1          0 |         1 
deutsche bank ag ne.. |         5          3 |         8 
deutsche bank luxem.. |         1          0 |         1 
deutsche bank secur.. |         2          0 |         2 
deutsche bank secur.. |        21         11 |        32 
deutsche bank secur.. |         0          2 |         2 
deutsche bank secur.. |         0          1 |         1 
deutsche bank secur.. |         1          0 |         1 
deutsche bank secur.. |         1          0 |         1 
deutsche bank secur.. |         0          1 |         1 
deutsche bank trust.. |         5          3 |         8 
deutsche schiffsban.. |         1          0 |         1 
     dnb nor bank asa |         1          0 |         1 
dnb nor bank asa (n.. |         0          1 |         1 
          dvb bank se |         1          0 |         1 
dz bank ag deutsche.. |         1          0 |         1 
       east west bank |         1          1 |         2 
efg eurobank ergasi.. |         1          0 |         1 
  erste group bank ag |         1          0 |         1 
     fifth third bank |        20          5 |        25 
first international.. |         1          0 |         1 
first internet bank.. |         1          0 |         1 
       five star bank |         1          0 |         1 
goldman sachs bank .. |        19         12 |        31 
goldman sachs bank .. |         1          0 |         1 
goldman sachs credi.. |         1          0 |         1 
goldman sachs lendi.. |        11          5 |        16 
goldman sachs speci.. |         0          1 |         1 
                 hsbc |         1          0 |         1 
     hsbc bank canada |         1          0 |         1 
        hsbc bank usa |        11          0 |        11 
hsbc securities (us.. |         1          1 |         2 
    investec bank plc |         2          1 |         3 
 jp morgan chase bank |         1          0 |         1 
 jp morgan securities |         3          0 |         3 
jp morgan securitie.. |         8          0 |         8 
jp morgan securitie.. |         1          0 |         1 
jp morgan securitie.. |        76         15 |        91 
jp morgan securitie.. |         0          1 |         1 
jp morgan securitie.. |         1          0 |         1 
jp morgan securitie.. |         1          0 |         1 
jp morgan securitie.. |         3          1 |         4 
jp morgan securitie.. |         2          0 |         2 
  jpmorgan chase bank |       287         45 |       332 
jpmorgan chase secu.. |         0          1 |         1 
jpmorgan securities.. |         1          1 |         2 
jpmorgan securities.. |         0          1 |         1 
              keybank |         1          0 |         1 
keybank capital mar.. |        14          1 |        15 
keybank capital mar.. |         9          1 |        10 
keybank capital mar.. |         1          0 |         1 
keybank national as.. |        25          0 |        25 
         liberty bank |         1          0 |         1 
      lloyds bank plc |         0          2 |         2 
  lloyds tsb bank plc |         1          0 |         1 
  lydian private bank |         1          0 |         1 
macquarie bank limi.. |         3          0 |         3 
maine municipal bon.. |         1          0 |         1 
              merrill |         2          0 |         2 
        merrill lynch |       105         12 |       117 
merrill lynch fenne.. |         1          0 |         1 
merrill lynch pierc.. |         1          0 |         1 
middlesex savings b.. |         1          0 |         1 
        midfirst bank |         1          0 |         1 
minnesota bank & tr.. |         1          0 |         1 
          mizuho bank |         2          1 |         3 
mizuho corporate ba.. |         1          0 |         1 
morgan stanley & co.. |         1          0 |         1 
  morgan stanley bank |         3          1 |         4 
morgan stanley capi.. |         1          0 |         1 
morgan stanley mufg.. |         0          1 |         1 
morgan stanley seni.. |        19         25 |        44 
            mufg bank |         3          0 |         3 
      mufg union bank |         2          0 |         2 
 mutual of omaha bank |         1          0 |         1 
national australia .. |         3          0 |         3 
         needham bank |         1          0 |         1 
norddeutsche landes.. |         1          0 |         1 
nordea bank ab (publ) |         2          0 |         2 
      nordea bank abp |         3          0 |         3 
nordea bank finland.. |         6          3 |         9 
old plank trail com.. |         1          0 |         1 
         onewest bank |         1          0 |         1 
 pacific western bank |         2          0 |         2 
      park state bank |         1          0 |         1 
   plainscapital bank |         1          0 |         1 
             pnc bank |        66         10 |        76 
  pnc capital markets |         3          0 |         3 
pnc capital markets.. |        33          1 |        34 
privatebank and tru.. |         1          0 |         1 
       rbc bank (usa) |         1          0 |         1 
  rbc capital markets |        15          8 |        23 
 rbs business capital |         1          0 |         1 
         rbs citizens |         8          2 |        10 
   rbs securities inc |         1          0 |         1 
         regions bank |         8          1 |         9 
republic first bank.. |         1          0 |         1 
 royal bank of canada |         9          3 |        12 
royal banks of miss.. |         2          0 |         2 
  silicon valley bank |         8          0 |         8 
 socit gnrale |         6          1 |         7 
sterling national b.. |         9          0 |         9 
stillwater national.. |         1          0 |         1 
sumitomo mitsui ban.. |         2          0 |         2 
sumitomo mitsui tru.. |         1          0 |         1 
        suntrust bank |        15          0 |        15 
suntrust robinson h.. |        18          3 |        21 
              td bank |         2          0 |         2 
   texas capital bank |         3          0 |         3 
the bank of new yor.. |         0          1 |         1 
the bank of new yor.. |         5          0 |         5 
the bank of nova sc.. |         5          0 |         5 
the bank of tokyo-m.. |         9          0 |         9 
     the bankorp bank |         1          0 |         1 
the f&m bank & trus.. |         1          0 |         1 
the huntington nati.. |         4          0 |         4 
the korea developme.. |         2          0 |         2 
the mauritius comme.. |         1          0 |         1 
the privatebank and.. |         6          0 |         6 
the toronto-dominio.. |         1          0 |         1 
toronto dominion (t.. |         1          0 |         1 
          truist bank |         3          0 |         3 
               ubs ag |         2          1 |         3 
       ubs securities |         1          0 |         1 
   ubs securities llc |         6          4 |        10 
           union bank |         2          0 |         2 
              us bank |         2          0 |         2 
us bank national as.. |        42         10 |        52 
 valley national bank |         1          0 |         1 
        wachovia bank |         1          0 |         1 
         webster bank |         2          0 |         2 
     wells fargo bank |       111         50 |       161 
wells fargo bank no.. |         1          0 |         1 
wells fargo capital.. |        10         17 |        27 
wells fargo energy .. |         2          0 |         2 
 wells fargo foothill |         0          1 |         1 
wells fargo foothil.. |         1          0 |         1 
wells fargo preferr.. |         1          0 |         1 
wells fargo retail .. |         3          0 |         3 
wells fargo securit.. |        94          7 |       101 
wells fargo securit.. |         1          0 |         1 
western alliance bank |         1          0 |         1 
            westlb ag |         2          0 |         2 
wheaton bank & trus.. |         1          0 |         1 
         whitney bank |         1          0 |         1 
        wintrust bank |         1          0 |         1 
woodforest national.. |         2          0 |         2 
----------------------+----------------------+----------
                Total |     1,939        400 |     2,339 

.         tab lead_arranger big_bank

                      |       Big Bank
        lead_arranger |         0          1 |     Total
----------------------+----------------------+----------
     abn amro bank nv |         3          0 |         3 
    absa bank limited |         1          0 |         1 
            ally bank |         2          0 |         2 
        alpha bank ae |         2          0 |         2 
amegy bank national.. |         1          0 |         1 
      associated bank |         1          0 |         1 
     bangkok bank pcl |         1          0 |         1 
     bank hapoalim bm |         2          0 |         2 
       bank leumi usa |         1          0 |         1 
      bank of america |         0        248 |       248 
bank of america lea.. |         0          2 |         2 
bank of america mer.. |         0         17 |        17 
bank of america mer.. |         0          1 |         1 
bank of america sec.. |         0         18 |        18 
bank of america sec.. |         0          1 |         1 
        bank of china |         1          0 |         1 
     bank of montreal |        16          0 |        16 
     bank of the west |         2          0 |         2 
banka monte dei pas.. |         1          0 |         1 
bankers trust company |         2          0 |         2 
banko de crdito d.. |         1          0 |         1 
      banko santander |         1          0 |         1 
           bankunited |         2          0 |         2 
    barclays bank plc |        46          0 |        46 
barclays bank plc a.. |         2          0 |         2 
     barclays capital |         7          0 |         7 
 barclays capital inc |         1          0 |         1 
         bbva compass |         1          0 |         1 
  bbva securities inc |         2          0 |         2 
             bbva usa |         1          0 |         1 
  bmo capital markets |        14          0 |        14 
bmo capital markets.. |        19          0 |        19 
bmo capital markets.. |         1          0 |         1 
bmo capital markets.. |         1          0 |         1 
      bmo harris bank |         1          0 |         1 
   bmo harris bank na |        13          0 |        13 
bmo private equity .. |         1          0 |         1 
          bnp paribas |        10          0 |        10 
bnp paribas and soc.. |         1          0 |         1 
bnp paribas securit.. |         4          0 |         4 
      bofa securities |         0         52 |        52 
branch banking and .. |         1          0 |         1 
         cadence bank |         2          0 |         2 
canadian imperial b.. |         2          0 |         2 
          capital one |        11          0 |        11 
capital one busines.. |         1          0 |         1 
capital one leverag.. |         1          0 |         1 
china merchants ban.. |         2          0 |         2 
        cibc bank usa |         3          0 |         3 
cibc world markets .. |         1          0 |         1 
             citibank |         0         56 |        56 
  citibank europe plc |         0          1 |         1 
          citibank na |         0          1 |         1 
citicorp internatio.. |         0          1 |         1 
citicorp north amer.. |         0          1 |         1 
         citicorp usa |         0          1 |         1 
citigroup global ma.. |         0         34 |        34 
citigroup global ma.. |         0          1 |         1 
citigroup global ma.. |         0          1 |         1 
citigroup global ma.. |         0          1 |         1 
citigroup global ma.. |         0          1 |         1 
citigroup global ma.. |         0          1 |         1 
citigroup global ma.. |         0          1 |         1 
        citizens bank |        15          0 |        15 
citizens bank of pe.. |         2          0 |         2 
citizens capital ma.. |         1          0 |         1 
   city national bank |         2          0 |         2 
               cobank |        16          0 |        16 
        comenity bank |         1          0 |         1 
        comerica bank |        11          0 |        11 
comerica bank and b.. |         1          0 |         1 
commerzbank aktieng.. |         2          0 |         2 
community banks of .. |         1          0 |         1 
         compass bank |         3          0 |         3 
cooperatieve centra.. |         1          0 |         1 
coperatieve centr.. |         1          0 |         1 
coperatieve centr.. |         2          0 |         2 
credit agricole cor.. |         3          0 |         3 
        credit suisse |         0          3 |         3 
     credit suisse ag |         0         25 |        25 
credit suisse first.. |         0          2 |         2 
credit suisse loan .. |         0          5 |         5 
credit suisse secur.. |         0         47 |        47 
crdit agricole co.. |         6          0 |         6 
         dbs bank ltd |         1          0 |         1 
     deutsche bank ag |         0         11 |        11 
deutsche bank ag ca.. |         0          1 |         1 
deutsche bank ag de.. |         0          1 |         1 
deutsche bank ag ne.. |         0          8 |         8 
deutsche bank luxem.. |         0          1 |         1 
deutsche bank secur.. |         0          2 |         2 
deutsche bank secur.. |         0         32 |        32 
deutsche bank secur.. |         0          2 |         2 
deutsche bank secur.. |         0          1 |         1 
deutsche bank secur.. |         0          1 |         1 
deutsche bank secur.. |         0          1 |         1 
deutsche bank secur.. |         0          1 |         1 
deutsche bank trust.. |         0          8 |         8 
deutsche schiffsban.. |         0          1 |         1 
     dnb nor bank asa |         1          0 |         1 
dnb nor bank asa (n.. |         1          0 |         1 
          dvb bank se |         1          0 |         1 
dz bank ag deutsche.. |         0          1 |         1 
       east west bank |         2          0 |         2 
efg eurobank ergasi.. |         1          0 |         1 
  erste group bank ag |         1          0 |         1 
     fifth third bank |        25          0 |        25 
first international.. |         1          0 |         1 
first internet bank.. |         1          0 |         1 
       five star bank |         1          0 |         1 
goldman sachs bank .. |         0         31 |        31 
goldman sachs bank .. |         0          1 |         1 
goldman sachs credi.. |         0          1 |         1 
goldman sachs lendi.. |         0         16 |        16 
goldman sachs speci.. |         0          1 |         1 
                 hsbc |         1          0 |         1 
     hsbc bank canada |         1          0 |         1 
        hsbc bank usa |        11          0 |        11 
hsbc securities (us.. |         2          0 |         2 
    investec bank plc |         3          0 |         3 
 jp morgan chase bank |         0          1 |         1 
 jp morgan securities |         0          3 |         3 
jp morgan securitie.. |         0          8 |         8 
jp morgan securitie.. |         0          1 |         1 
jp morgan securitie.. |         0         91 |        91 
jp morgan securitie.. |         0          1 |         1 
jp morgan securitie.. |         0          1 |         1 
jp morgan securitie.. |         0          1 |         1 
jp morgan securitie.. |         0          4 |         4 
jp morgan securitie.. |         0          2 |         2 
  jpmorgan chase bank |         0        332 |       332 
jpmorgan chase secu.. |         0          1 |         1 
jpmorgan securities.. |         0          2 |         2 
jpmorgan securities.. |         0          1 |         1 
              keybank |         1          0 |         1 
keybank capital mar.. |        15          0 |        15 
keybank capital mar.. |        10          0 |        10 
keybank capital mar.. |         1          0 |         1 
keybank national as.. |        25          0 |        25 
         liberty bank |         1          0 |         1 
      lloyds bank plc |         2          0 |         2 
  lloyds tsb bank plc |         1          0 |         1 
  lydian private bank |         1          0 |         1 
macquarie bank limi.. |         3          0 |         3 
maine municipal bon.. |         1          0 |         1 
              merrill |         2          0 |         2 
        merrill lynch |         0        117 |       117 
merrill lynch fenne.. |         0          1 |         1 
merrill lynch pierc.. |         0          1 |         1 
middlesex savings b.. |         1          0 |         1 
        midfirst bank |         1          0 |         1 
minnesota bank & tr.. |         1          0 |         1 
          mizuho bank |         3          0 |         3 
mizuho corporate ba.. |         1          0 |         1 
morgan stanley & co.. |         0          1 |         1 
  morgan stanley bank |         0          4 |         4 
morgan stanley capi.. |         0          1 |         1 
morgan stanley mufg.. |         0          1 |         1 
morgan stanley seni.. |         0         44 |        44 
            mufg bank |         3          0 |         3 
      mufg union bank |         2          0 |         2 
 mutual of omaha bank |         1          0 |         1 
national australia .. |         3          0 |         3 
         needham bank |         1          0 |         1 
norddeutsche landes.. |         0          1 |         1 
nordea bank ab (publ) |         2          0 |         2 
      nordea bank abp |         3          0 |         3 
nordea bank finland.. |         9          0 |         9 
old plank trail com.. |         1          0 |         1 
         onewest bank |         1          0 |         1 
 pacific western bank |         2          0 |         2 
      park state bank |         1          0 |         1 
   plainscapital bank |         1          0 |         1 
             pnc bank |        76          0 |        76 
  pnc capital markets |         3          0 |         3 
pnc capital markets.. |        34          0 |        34 
privatebank and tru.. |         1          0 |         1 
       rbc bank (usa) |         1          0 |         1 
  rbc capital markets |        23          0 |        23 
 rbs business capital |         1          0 |         1 
         rbs citizens |        10          0 |        10 
   rbs securities inc |         1          0 |         1 
         regions bank |         9          0 |         9 
republic first bank.. |         1          0 |         1 
 royal bank of canada |        12          0 |        12 
royal banks of miss.. |         2          0 |         2 
  silicon valley bank |         8          0 |         8 
 socit gnrale |         7          0 |         7 
sterling national b.. |         9          0 |         9 
stillwater national.. |         1          0 |         1 
sumitomo mitsui ban.. |         2          0 |         2 
sumitomo mitsui tru.. |         1          0 |         1 
        suntrust bank |        15          0 |        15 
suntrust robinson h.. |        21          0 |        21 
              td bank |         2          0 |         2 
   texas capital bank |         3          0 |         3 
the bank of new yor.. |         1          0 |         1 
the bank of new yor.. |         5          0 |         5 
the bank of nova sc.. |         5          0 |         5 
the bank of tokyo-m.. |         9          0 |         9 
     the bankorp bank |         1          0 |         1 
the f&m bank & trus.. |         1          0 |         1 
the huntington nati.. |         4          0 |         4 
the korea developme.. |         2          0 |         2 
the mauritius comme.. |         1          0 |         1 
the privatebank and.. |         6          0 |         6 
the toronto-dominio.. |         1          0 |         1 
toronto dominion (t.. |         1          0 |         1 
          truist bank |         3          0 |         3 
               ubs ag |         3          0 |         3 
       ubs securities |         1          0 |         1 
   ubs securities llc |        10          0 |        10 
           union bank |         2          0 |         2 
              us bank |         2          0 |         2 
us bank national as.. |        52          0 |        52 
 valley national bank |         1          0 |         1 
        wachovia bank |         1          0 |         1 
         webster bank |         2          0 |         2 
     wells fargo bank |         0        161 |       161 
wells fargo bank no.. |         0          1 |         1 
wells fargo capital.. |         0         27 |        27 
wells fargo energy .. |         0          2 |         2 
 wells fargo foothill |         0          1 |         1 
wells fargo foothil.. |         0          1 |         1 
wells fargo preferr.. |         0          1 |         1 
wells fargo retail .. |         0          3 |         3 
wells fargo securit.. |         0        101 |       101 
wells fargo securit.. |         0          1 |         1 
western alliance bank |         1          0 |         1 
            westlb ag |         2          0 |         2 
wheaton bank & trus.. |         1          0 |         1 
         whitney bank |         1          0 |         1 
        wintrust bank |         1          0 |         1 
woodforest national.. |         2          0 |         2 
----------------------+----------------------+----------
                Total |       776      1,563 |     2,339 

.         * regression    
.         local borr_vars "scaled_ebitda ln_atq roa leverage"

.         local deal_vars "ln_deal_amount maturity_year interest_spread1" 

.         local y_vars "lender_is_nonbank lender_is_private_credit" 

.         local info_vars "monthly_fs projected_fs lender_meeting hard_info info_n all_info"

.         order lead_arranger `info_vars' `borr_vars' `deal_vars'

.         gsort lead_arranger

.         foreach var of varlist `info_vars' {
  2.                 eststo: reghdfe `var' big_bank `borr_vars' `deal_vars', absorb(year ff_12)
  3.         }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =      19.44
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1062
                                                  Adj R-squared   =     0.0938
                                                  Within R-sq.    =     0.0632
                                                  Root MSE        =     0.4083

----------------------------------------------------------------------------------
      monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |   .0354962   .0190845     1.86   0.063    -.0019284    .0729208
   scaled_ebitda |  -.4451567   .0963856    -4.62   0.000    -.6341682   -.2561452
          ln_atq |  -.0600681   .0101348    -5.93   0.000    -.0799425   -.0401938
             roa |  -.8181378    .252724    -3.24   0.001    -1.313728   -.3225476
        leverage |   .0447003   .0359997     1.24   0.214     -.025895    .1152955
  ln_deal_amount |  -.0074036   .0095838    -0.77   0.440    -.0261973    .0113902
   maturity_year |  -.0157575   .0043352    -3.63   0.000    -.0242588   -.0072562
interest_spread1 |   -.011222   .0040431    -2.78   0.006    -.0191505   -.0032935
           _cons |   .8206237   .0593887    13.82   0.000     .7041628    .9370846
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =      16.67
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1172
                                                  Adj R-squared   =     0.1049
                                                  Within R-sq.    =     0.0547
                                                  Root MSE        =     0.4659

----------------------------------------------------------------------------------
    projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |  -.0010527    .021776    -0.05   0.961    -.0437553    .0416499
   scaled_ebitda |  -.2517012   .1099788    -2.29   0.022     -.467369   -.0360335
          ln_atq |  -.1244842   .0115641   -10.76   0.000    -.1471614    -.101807
             roa |  -.2188665   .2883656    -0.76   0.448    -.7843496    .3466166
        leverage |   .0449708   .0410768     1.09   0.274    -.0355805    .1255221
  ln_deal_amount |   .0579668   .0109354     5.30   0.000     .0365225     .079411
   maturity_year |   .0044683   .0049466     0.90   0.366     -.005232    .0141685
interest_spread1 |   .0016106   .0046133     0.35   0.727     -.007436    .0106573
           _cons |    1.13795   .0677643    16.79   0.000     1.005065    1.270836
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =      17.26
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1052
                                                  Adj R-squared   =     0.0928
                                                  Within R-sq.    =     0.0565
                                                  Root MSE        =     0.3587

----------------------------------------------------------------------------------
  lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |   .0360186   .0167677     2.15   0.032     .0031372    .0688999
   scaled_ebitda |  -.2420422   .0846846    -2.86   0.004    -.4081082   -.0759762
          ln_atq |   -.029815   .0089045    -3.35   0.001    -.0472767   -.0123534
             roa |  -.3064253    .222044    -1.38   0.168    -.7418521    .1290015
        leverage |   .1825149   .0316295     5.77   0.000     .1204897    .2445401
  ln_deal_amount |   .0237311   .0084203     2.82   0.005     .0072188    .0402433
   maturity_year |   .0106549   .0038089     2.80   0.005     .0031856    .0181241
interest_spread1 |    .019242   .0035523     5.42   0.000      .012276     .026208
           _cons |   .0081793   .0521791     0.16   0.875    -.0941436    .1105022
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =      20.25
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1140
                                                  Adj R-squared   =     0.1017
                                                  Within R-sq.    =     0.0656
                                                  Root MSE        =     0.4508

----------------------------------------------------------------------------------
       hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |   .0181778   .0210717     0.86   0.388    -.0231436    .0594993
   scaled_ebitda |  -.3449581   .1064218    -3.24   0.001    -.5536505   -.1362657
          ln_atq |  -.1336218   .0111901   -11.94   0.000    -.1555655    -.111678
             roa |  -.2942629    .279039    -1.05   0.292    -.8414566    .2529308
        leverage |   .0635419   .0397482     1.60   0.110    -.0144041    .1414879
  ln_deal_amount |   .0638198   .0105817     6.03   0.000     .0430692    .0845705
   maturity_year |  -.0051772   .0047866    -1.08   0.280    -.0145637    .0042093
interest_spread1 |   -.000931   .0044641    -0.21   0.835    -.0096851     .007823
           _cons |   1.278379   .0655726    19.50   0.000     1.149791    1.406966
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =      26.49
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1408
                                                  Adj R-squared   =     0.1288
                                                  Within R-sq.    =     0.0842
                                                  Root MSE        =     0.7690

----------------------------------------------------------------------------------
          info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |   .0704621   .0359454     1.96   0.050    -.0000266    .1409507
   scaled_ebitda |  -.9389002   .1815407    -5.17   0.000      -1.2949      -.5829
          ln_atq |  -.2143673   .0190888   -11.23   0.000    -.2518003   -.1769343
             roa |   -1.34343   .4760017    -2.82   0.005    -2.276866   -.4099934
        leverage |    .272186   .0678049     4.01   0.000      .139221     .405151
  ln_deal_amount |   .0742943   .0180509     4.12   0.000     .0388965     .109692
   maturity_year |  -.0006344   .0081653    -0.08   0.938    -.0166464    .0153777
interest_spread1 |   .0096306   .0076151     1.26   0.206    -.0053026    .0245638
           _cons |   1.966753   .1118577    17.58   0.000     1.747401    2.186106
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      2,339
Absorbing 2 HDFE groups                           F(   8,   2306) =       3.53
                                                  Prob > F        =     0.0005
                                                  R-squared       =     0.0345
                                                  Adj R-squared   =     0.0211
                                                  Within R-sq.    =     0.0121
                                                  Root MSE        =     0.1893

----------------------------------------------------------------------------------
        all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        big_bank |   .0137406     .00885     1.55   0.121    -.0036142    .0310954
   scaled_ebitda |  -.1374308   .0446966    -3.07   0.002    -.2250804   -.0497811
          ln_atq |  -.0145798   .0046998    -3.10   0.002     -.023796   -.0053635
             roa |  -.1422378   .1171949    -1.21   0.225    -.3720562    .0875806
        leverage |   .0317214    .016694     1.90   0.058    -.0010155    .0644583
  ln_deal_amount |   .0065748   .0044443     1.48   0.139    -.0021404      .01529
   maturity_year |   -.001391   .0020103    -0.69   0.489    -.0053333    .0025513
interest_spread1 |  -.0002288   .0018749    -0.12   0.903    -.0039054    .0034479
           _cons |   .0979565   .0275401     3.56   0.000     .0439504    .1519625
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est6 stored)

.         esttab using "$tabdir/Table7_bank.tex", replace ///
>         nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
>         star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table7_bank.tex)

.         * clear storeed est
.         eststo clear

. restore

. 
. *** Same/Different Industry (Specialization)
. 
. use "$cleandir/final_regression_sample.dta", clear

. 
. *** different industry from expertise
.         * change industry to ff_12
.         forvalues i = 1/3 {
  2.                 gen industry`i'_12 = 6 if industry_`i' == "Business Services" | industry_`i' == "Information Technology"
  3.                 replace industry`i'_12 = 1 if industry_`i' == "Consumer Discretionary"
  4.                 replace industry`i'_12 = 4 if industry_`i' == "Energy & Utilities"
  5.                 replace industry`i'_12 = 11 if industry_`i' == "Financial & Insurance Services"
  6.                 replace industry`i'_12 = 10 if industry_`i' == "Healthcare"
  7.                 replace industry`i'_12 = 3 if industry_`i' == "Industrials"
  8.                 replace industry`i'_12 = 4 if industry_`i' == "Raw Materials & Natural Resources"
  9.         }
(2,793 missing values generated)
(732 real changes made)
(10 real changes made)
(5 real changes made)
(318 real changes made)
(205 real changes made)
(46 real changes made)
(2,640 missing values generated)
(333 real changes made)
(19 real changes made)
(13 real changes made)
(41 real changes made)
(642 real changes made)
(17 real changes made)
(2,481 missing values generated)
(286 real changes made)
(184 real changes made)
(103 real changes made)
(145 real changes made)
(85 real changes made)
(35 real changes made)

.         order industry* ff_12

.         
.         gen same_industry = 1 if industry1_12 == ff_12 
(2,891 missing values generated)

.         replace same_industry = 1 if industry2_12 == ff_12
(169 real changes made)

.         replace same_industry = 1 if industry3_12 == ff_12
(140 real changes made)

.         replace same_industry = 0 if same_industry == .
(2,582 real changes made)

.         
.         gen inter = lender_is_nonbank * same_industry

.         
.         la var same_industry "Same Industry"

.         la var inter "Lender is Nonbank X Same Industry"

.         
.         foreach var of varlist `info_vars' {
  2.                 eststo: reghdfe `var' lender_is_nonbank inter `borr_vars' `deal_vars', absorb(year ff_12)
  3.         }
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      32.70
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1285
                                                  Adj R-squared   =     0.1189
                                                  Within R-sq.    =     0.0901
                                                  Root MSE        =     0.4237

-----------------------------------------------------------------------------------
       monthly_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .1190635   .0224653     5.30   0.000     .0750145    .1631126
            inter |   .0587097   .0687459     0.85   0.393    -.0760848    .1935041
    scaled_ebitda |  -.1234734   .0736668    -1.68   0.094    -.2679166    .0209697
           ln_atq |  -.0671981   .0081833    -8.21   0.000    -.0832436   -.0511526
              roa |  -.4595343   .2070481    -2.22   0.027    -.8655064   -.0535622
         leverage |   .0530222   .0311971     1.70   0.089     -.008148    .1141923
   ln_deal_amount |  -.0028875   .0065967    -0.44   0.662    -.0158221     .010047
    maturity_year |   -.023696   .0036219    -6.54   0.000    -.0307976   -.0165944
 interest_spread1 |  -.0016567    .003293    -0.50   0.615    -.0081134       .0048
            _cons |   .8313906   .0535428    15.53   0.000     .7264059    .9363753
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      14.24
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1011
                                                  Adj R-squared   =     0.0911
                                                  Within R-sq.    =     0.0413
                                                  Root MSE        =     0.4694

-----------------------------------------------------------------------------------
     projected_fs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0443432   .0248893    -1.78   0.075    -.0931451    .0044587
            inter |   .0976108   .0761636     1.28   0.200    -.0517279    .2469495
    scaled_ebitda |  -.0205663   .0816155    -0.25   0.801    -.1805948    .1394623
           ln_atq |  -.0950328   .0090663   -10.48   0.000    -.1128096    -.077256
              roa |   .0051538   .2293885     0.02   0.982    -.4446226    .4549301
         leverage |  -.0106265   .0345633    -0.31   0.759    -.0783969    .0571439
   ln_deal_amount |   .0271931   .0073085     3.72   0.000      .012863    .0415233
    maturity_year |   -.001637   .0040127    -0.41   0.683    -.0095048    .0062309
 interest_spread1 |   .0044177   .0036483     1.21   0.226    -.0027357    .0115711
            _cons |   1.117499     .05932    18.84   0.000     1.001187    1.233812
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      23.59
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1139
                                                  Adj R-squared   =     0.1041
                                                  Within R-sq.    =     0.0667
                                                  Root MSE        =     0.3755

-----------------------------------------------------------------------------------
   lender_meeting | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0278075   .0199104     1.40   0.163    -.0112322    .0668471
            inter |   .2325253   .0609279     3.82   0.000     .1130602    .3519905
    scaled_ebitda |  -.0224456   .0652892    -0.34   0.731    -.1504622     .105571
           ln_atq |  -.0205375   .0072527    -2.83   0.005    -.0347582   -.0063167
              roa |  -.1143309   .1835019    -0.62   0.533    -.4741344    .2454727
         leverage |   .1786191   .0276493     6.46   0.000     .1244054    .2328328
   ln_deal_amount |    .029669   .0058465     5.07   0.000     .0182054    .0411325
    maturity_year |   .0048883     .00321     1.52   0.128    -.0014057    .0111823
 interest_spread1 |   .0189641   .0029185     6.50   0.000     .0132417    .0246866
            _cons |  -.0523207   .0474537    -1.10   0.270    -.1453661    .0407248
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est3 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      18.94
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0954
                                                  Adj R-squared   =     0.0854
                                                  Within R-sq.    =     0.0542
                                                  Root MSE        =     0.4525

-----------------------------------------------------------------------------------
        hard_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |  -.0275484   .0239964    -1.15   0.251    -.0745996    .0195028
            inter |   .0763912   .0734314     1.04   0.298    -.0675902    .2203727
    scaled_ebitda |  -.0406589   .0786877    -0.52   0.605    -.1949467    .1136289
           ln_atq |  -.1004772    .008741   -11.49   0.000    -.1176163   -.0833382
              roa |  -.1222036   .2211597    -0.55   0.581    -.5558452    .3114379
         leverage |   .0288295   .0333234     0.87   0.387    -.0365098    .0941688
   ln_deal_amount |   .0269105   .0070463     3.82   0.000     .0130945    .0407266
    maturity_year |  -.0100817   .0038687    -2.61   0.009    -.0176673    -.002496
 interest_spread1 |   .0041434   .0035174     1.18   0.239    -.0027534    .0110402
            _cons |   1.243178   .0571921    21.74   0.000     1.131038    1.355318
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est4 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      31.50
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1393
                                                  Adj R-squared   =     0.1298
                                                  Within R-sq.    =     0.0871
                                                  Root MSE        =     0.8206

-----------------------------------------------------------------------------------
           info_n | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .1025278   .0435146     2.36   0.019      .017206    .1878496
            inter |   .3888458   .1331591     2.92   0.004     .1277526    .6499391
    scaled_ebitda |  -.1664853   .1426907    -1.17   0.243    -.4462679    .1132973
           ln_atq |  -.1827684   .0158508   -11.53   0.000     -.213848   -.1516887
              roa |  -.5687114   .4010467    -1.42   0.156    -1.355069    .2176459
         leverage |   .2210148    .060428     3.66   0.000     .1025298    .3394998
   ln_deal_amount |   .0539746   .0127776     4.22   0.000     .0289207    .0790284
    maturity_year |  -.0204446   .0070155    -2.91   0.004    -.0342003    -.006689
 interest_spread1 |   .0217251   .0063784     3.41   0.001     .0092186    .0342316
            _cons |   1.896569    .103711    18.29   0.000     1.693216    2.099922
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est5 stored)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =      3,007
Absorbing 2 HDFE groups                           F(   9,   2973) =      18.22
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0763
                                                  Adj R-squared   =     0.0661
                                                  Within R-sq.    =     0.0523
                                                  Root MSE        =     0.2305

-----------------------------------------------------------------------------------
         all_info | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
lender_is_nonbank |   .0738392   .0122218     6.04   0.000     .0498752    .0978032
            inter |   .1958605   .0373999     5.24   0.000     .1225282    .2691927
    scaled_ebitda |   .0169848    .040077     0.42   0.672    -.0615966    .0955663
           ln_atq |  -.0158382    .004452    -3.56   0.000    -.0245675    -.007109
              roa |   .0895281   .1126404     0.79   0.427     -.131333    .3103893
         leverage |   .0374566   .0169722     2.21   0.027     .0041782     .070735
   ln_deal_amount |   .0073038   .0035888     2.04   0.042      .000267    .0143406
    maturity_year |  -.0053629   .0019704    -2.72   0.007    -.0092264   -.0014994
 interest_spread1 |   .0052053   .0017915     2.91   0.004     .0016927     .008718
            _cons |   .0883449   .0291289     3.03   0.002       .03123    .1454597
-----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        14           0          14     |
       ff_12 |        12           1          11     |
-----------------------------------------------------+
(est6 stored)

.         esttab using "$tabdir/Table8_industry.tex", replace ///
>         nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
>         star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/Information Covenants of Direct Lending/Tables/Table8_industry.tex)

.         * clear storeed est
.         eststo clear

. 
. ********************************************************************************
. log close 
      name:  <unnamed>
       log:  /Users/zrsong/Dropbox (MIT)/Research Projects/Direct Lending/Code/LogFiles/Analyze_Merged_Covenants.log
  log type:  text
 closed on:  14 Nov 2024, 21:10:19
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
